{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_16",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            32
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "dense_47_input"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_47",
          "trainable": true,
          "dtype": "float32",
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "weights": [
          [
            0.006312110926955938,
            -0.04762367904186249,
            0.04888571798801422,
            -0.026910023763775826,
            -0.029313642531633377,
            0.0151832802221179,
            0.045751720666885376,
            -0.028444677591323853,
            -0.04016498848795891,
            -0.0076994081027805805,
            -0.014970269985496998,
            0.006172220688313246,
            0.007417050190269947,
            0.0016156153287738562,
            0.06390757858753204,
            0.04343326762318611,
            0.006071141455322504,
            -0.026919089257717133,
            0.022074511274695396,
            -0.007126035634428263,
            0.0021155495196580887,
            0.08380400389432907,
            0.0665685385465622,
            -0.016740789636969566,
            -0.08350697159767151,
            -0.04797488451004028,
            0.005808575078845024,
            0.0027699426282197237,
            -0.03560103848576546,
            -0.02131565473973751,
            0.045733872801065445,
            -0.02988329343497753,
            -0.0012554002460092306,
            -0.014996394515037537,
            0.022558018565177917,
            -0.05416259169578552,
            0.010614096187055111,
            0.04808918014168739,
            0.020498936995863914,
            0.013719044625759125,
            0.016937877982854843,
            -0.00929208006709814,
            -0.02177468314766884,
            -0.016811102628707886,
            -0.04959697276353836,
            0.015860194340348244,
            -0.009968270547688007,
            -0.03113630972802639,
            0.056089334189891815,
            0.0017279086168855429,
            0.03642422705888748,
            -0.0079568549990654,
            0.01546572893857956,
            -0.026297738775610924,
            0.03418856859207153,
            -0.018429961055517197,
            -0.009270892478525639,
            -0.023338567465543747,
            -0.004559940658509731,
            0.005749760661274195,
            0.025984371080994606,
            -0.016653520986437798,
            -0.006779470480978489,
            0.031515154987573624
          ],
          [
            0.09713834524154663,
            -0.019340336322784424,
            0.12561792135238647,
            -0.011288285255432129,
            -0.23066014051437378,
            -0.13013839721679688,
            -0.11878561973571777,
            -0.15265697240829468,
            -0.12409734725952148,
            -0.12652504444122314,
            0.10891753435134888,
            0.03783595561981201,
            -0.17001080513000488,
            -0.01633608341217041,
            -0.22139382362365723,
            0.18588989973068237,
            -0.06105148792266846,
            0.11864340305328369,
            -0.14121359586715698,
            -0.24805951118469238,
            -0.21055573225021362,
            0.08134579658508301,
            0.20991379022598267,
            0.04983854293823242,
            0.07102447748184204,
            0.17098182439804077,
            -0.1392030119895935,
            -0.07713901996612549,
            -0.10947388410568237,
            -0.06648123264312744,
            -0.028436601161956787,
            -0.18816131353378296,
            0.08076494932174683,
            -0.12931108474731445,
            0.029335618019104004,
            -0.21905791759490967,
            -0.09381461143493652,
            0.10194170475006104,
            -0.03879457712173462,
            -0.21191781759262085,
            -0.23632216453552246,
            -0.10091346502304077,
            0.1691645383834839,
            -0.09062546491622925,
            -0.038313210010528564,
            0.1311092972755432,
            0.2223721742630005,
            -0.16557812690734863,
            -0.21407079696655273,
            -0.09346956014633179,
            0.07854956388473511,
            -0.08797383308410645,
            0.00433957576751709,
            -0.24781590700149536,
            0.11060166358947754,
            0.24882346391677856,
            0.22904253005981445,
            -0.0038923025131225586,
            0.18965041637420654,
            0.1885523796081543,
            -0.1358160376548767,
            -0.13394105434417725,
            0.04140305519104004,
            0.1134909987449646
          ],
          [
            0.1490974873304367,
            -0.06965360045433044,
            -0.04777839779853821,
            0.08871262520551682,
            0.09548283368349075,
            0.15681873261928558,
            0.26328086853027344,
            0.01922799088060856,
            -0.31279096007347107,
            0.14361774921417236,
            0.07368462532758713,
            0.2059360295534134,
            -0.15259088575839996,
            -0.026360023766756058,
            -0.18938903510570526,
            -0.3774384558200836,
            -0.022436529397964478,
            0.02083301544189453,
            0.4237116277217865,
            0.28477513790130615,
            -0.056109365075826645,
            -0.27194422483444214,
            -0.2293669581413269,
            -0.09616382420063019,
            -0.001597132533788681,
            0.01812269724905491,
            -0.033960189670324326,
            -0.16608349978923798,
            -0.08427020162343979,
            0.07242424041032791,
            0.14277124404907227,
            0.1512124091386795,
            -0.08621163666248322,
            -0.004230181686580181,
            0.13058266043663025,
            -0.44636210799217224,
            -0.034756455570459366,
            0.24277189373970032,
            0.000657316530123353,
            0.06824130564928055,
            0.06259838491678238,
            -0.03927832841873169,
            0.3144298195838928,
            0.31634554266929626,
            0.23237481713294983,
            -0.17933908104896545,
            0.05304088443517685,
            0.045861922204494476,
            0.32934513688087463,
            -0.08393523842096329,
            -0.04654709994792938,
            0.1537279188632965,
            -0.38006460666656494,
            -0.04250511899590492,
            -0.008322739973664284,
            -0.14076440036296844,
            0.007505536545068026,
            -0.0676092728972435,
            -0.45221278071403503,
            -0.3502843976020813,
            -0.03634737432003021,
            0.07514329254627228,
            0.03124281018972397,
            0.09301777184009552
          ],
          [
            0.28783756494522095,
            0.21870072185993195,
            0.5513831973075867,
            0.18115569651126862,
            0.3844124972820282,
            -0.4410659372806549,
            0.31658321619033813,
            0.36191877722740173,
            -0.1446341723203659,
            0.13305389881134033,
            0.44182828068733215,
            0.04840274527668953,
            0.05208976939320564,
            0.22840556502342224,
            0.05462581664323807,
            -0.20356838405132294,
            -0.19301392138004303,
            0.11052752286195755,
            -0.7041312456130981,
            -0.3982448875904083,
            0.25150230526924133,
            -0.24876393377780914,
            0.08787772804498672,
            -0.13975968956947327,
            0.09843720495700836,
            -0.18797600269317627,
            -0.36525604128837585,
            -1.202263593673706,
            -0.05461845546960831,
            0.18858680129051208,
            -0.6398186087608337,
            0.010574817657470703,
            0.08871045708656311,
            0.15012672543525696,
            -0.4382408857345581,
            -0.21365059912204742,
            0.4480990469455719,
            -0.29586952924728394,
            0.1737164855003357,
            0.4140428900718689,
            0.20906737446784973,
            -0.30333128571510315,
            -0.008324346505105495,
            0.48527997732162476,
            -0.09790433198213577,
            0.20792797207832336,
            -0.29532432556152344,
            0.4118666350841522,
            -0.0019258847460150719,
            0.23086689412593842,
            0.23893363773822784,
            0.11937157809734344,
            -0.5029072165489197,
            0.4332069754600525,
            -0.2918272316455841,
            -0.2762317955493927,
            -0.10040156543254852,
            0.12087208777666092,
            -0.30936866998672485,
            -0.008785673417150974,
            -0.12214509397745132,
            -0.3748680353164673,
            0.14826814830303192,
            -0.7973757982254028
          ],
          [
            0.3486817181110382,
            0.21354208886623383,
            -0.15313439071178436,
            0.38057997822761536,
            0.10796749591827393,
            0.0695563480257988,
            0.19805961847305298,
            0.1300225704908371,
            -0.12405911087989807,
            -0.005744204856455326,
            0.024339236319065094,
            -0.23329778015613556,
            0.150620236992836,
            -0.024770377203822136,
            -0.1066880077123642,
            -0.12365909665822983,
            0.16293559968471527,
            0.22780223190784454,
            0.1284645050764084,
            0.018160995095968246,
            0.21273955702781677,
            -0.37645187973976135,
            -0.0040559046901762486,
            0.14909376204013824,
            -0.17897044122219086,
            0.1467851847410202,
            0.22718261182308197,
            0.03536321222782135,
            0.04979371652007103,
            -0.5822482705116272,
            -0.16159942746162415,
            -0.2735166847705841,
            0.026748737320303917,
            -0.2853257358074188,
            -0.047380480915308,
            -0.13222455978393555,
            -0.017761312425136566,
            0.04223888739943504,
            0.20791095495224,
            -0.1980016827583313,
            -0.04617571085691452,
            -0.012880277819931507,
            0.09734407812356949,
            -0.011658161878585815,
            -0.05788784101605415,
            -0.09978071600198746,
            -0.011307457461953163,
            0.0024186079390347004,
            -0.26188281178474426,
            -0.034799691289663315,
            -0.08506808429956436,
            -0.18517208099365234,
            0.22025573253631592,
            -0.016921892762184143,
            -0.189177468419075,
            -0.12640982866287231,
            0.02076677232980728,
            0.13161230087280273,
            -0.11068876832723618,
            0.29797056317329407,
            -0.5940159559249878,
            0.15099285542964935,
            -0.14473877847194672,
            0.10233285278081894
          ],
          [
            -0.07174211740493774,
            0.15700846910476685,
            0.1257765293121338,
            0.08372575044631958,
            -0.08258074522018433,
            0.03254574537277222,
            -0.1825156807899475,
            -0.20539969205856323,
            -0.14247548580169678,
            -0.0421866774559021,
            0.07119631767272949,
            -0.23700708150863647,
            0.2483559250831604,
            0.08700698614120483,
            0.1140642762184143,
            0.07041674852371216,
            -0.06556344032287598,
            -0.1478627324104309,
            0.17719870805740356,
            -0.21791893243789673,
            -0.07657361030578613,
            -0.007580578327178955,
            0.09377670288085938,
            0.16608792543411255,
            -0.02594679594039917,
            -0.19553393125534058,
            0.15678131580352783,
            0.18660539388656616,
            0.02638113498687744,
            0.13914239406585693,
            0.0868411660194397,
            -0.10220962762832642,
            0.1736862063407898,
            0.08533346652984619,
            0.09659308195114136,
            -0.23622190952301025,
            0.19279980659484863,
            -0.12443751096725464,
            0.0971556305885315,
            -0.10191577672958374,
            0.11423224210739136,
            -0.027052700519561768,
            -0.2467626929283142,
            0.15682941675186157,
            0.14329123497009277,
            -0.146007239818573,
            0.21711790561676025,
            -0.1851678490638733,
            -0.09089815616607666,
            0.24359345436096191,
            -0.04113680124282837,
            -0.24845200777053833,
            0.18768447637557983,
            -0.23772025108337402,
            0.23344802856445312,
            0.1654929518699646,
            -0.07513308525085449,
            -0.07864606380462646,
            -0.06695431470870972,
            -0.09548979997634888,
            0.13316106796264648,
            0.24573838710784912,
            0.24314957857131958,
            0.22572290897369385
          ],
          [
            0.44708824157714844,
            0.3038233816623688,
            0.15148422122001648,
            -0.3419140875339508,
            0.24869106709957123,
            0.038760989904403687,
            -0.03431357815861702,
            -0.0036711310967803,
            -0.08770333975553513,
            -0.34872522950172424,
            -0.022767065092921257,
            0.002368955872952938,
            0.060470979660749435,
            -0.14091268181800842,
            0.13586361706256866,
            -0.2977393865585327,
            -0.18075935542583466,
            0.32503625750541687,
            0.2354138195514679,
            0.4842361509799957,
            -0.04134998098015785,
            -0.08601503819227219,
            0.16799810528755188,
            -0.40868881344795227,
            0.22483129799365997,
            -0.14754368364810944,
            -0.13156303763389587,
            0.3835461437702179,
            -0.21385350823402405,
            0.18659605085849762,
            -0.2364891916513443,
            -0.46142545342445374,
            -0.2106674611568451,
            -0.07094050943851471,
            0.43940475583076477,
            -0.43616893887519836,
            0.4963317811489105,
            0.12891611456871033,
            -0.08948516845703125,
            -0.17322216928005219,
            -0.19096392393112183,
            -0.1755906641483307,
            -0.772010326385498,
            0.16424404084682465,
            0.41838982701301575,
            -0.3449184000492096,
            -0.024953419342637062,
            -0.04811650887131691,
            0.4009588658809662,
            -0.17480599880218506,
            0.23491507768630981,
            0.3118148148059845,
            -0.45655444264411926,
            0.14912764728069305,
            0.028835197910666466,
            -0.09993379563093185,
            -0.04880523681640625,
            0.23026196658611298,
            -0.014701400883495808,
            -0.03134569525718689,
            0.07602066546678543,
            -0.01248862687498331,
            -0.03664902225136757,
            0.3514397144317627
          ],
          [
            0.04146158695220947,
            0.168198823928833,
            0.2243557572364807,
            0.06572520732879639,
            0.17710548639297485,
            0.1417161226272583,
            -0.1869489550590515,
            0.15149354934692383,
            0.0029854774475097656,
            -0.18023192882537842,
            -0.21988272666931152,
            -0.061645686626434326,
            -0.15037769079208374,
            -0.2060219645500183,
            -0.1965693235397339,
            -0.1783338189125061,
            0.029676437377929688,
            0.0972633957862854,
            -0.16771334409713745,
            -0.2303602695465088,
            0.014812886714935303,
            -0.11882853507995605,
            0.05530834197998047,
            -0.20579051971435547,
            -0.2059459090232849,
            0.054139673709869385,
            -0.026177406311035156,
            -0.19173842668533325,
            0.08276164531707764,
            0.15546977519989014,
            0.19370037317276,
            0.04338860511779785,
            0.14736288785934448,
            -0.0140763521194458,
            -0.1919052004814148,
            0.09212571382522583,
            0.1988896131515503,
            -0.18943661451339722,
            0.17093783617019653,
            -0.12685203552246094,
            -0.23859792947769165,
            0.22945261001586914,
            -0.03189361095428467,
            0.06691718101501465,
            0.23217099905014038,
            -0.19649595022201538,
            -0.04842120409011841,
            0.12358605861663818,
            -0.12251126766204834,
            -0.07497382164001465,
            -0.10560327768325806,
            0.22101253271102905,
            0.0852002501487732,
            0.043663203716278076,
            -0.1353994607925415,
            0.18875092267990112,
            0.03498542308807373,
            -0.1660621166229248,
            -0.05714619159698486,
            -0.21448713541030884,
            0.24001681804656982,
            -0.19529199600219727,
            -0.15509110689163208,
            -0.04184240102767944
          ],
          [
            -0.018383681774139404,
            -0.03956407308578491,
            0.1161922812461853,
            0.18694454431533813,
            0.02762550115585327,
            -0.08541393280029297,
            0.24490511417388916,
            0.22354549169540405,
            0.24128806591033936,
            -0.07666659355163574,
            0.16912847757339478,
            -0.16492503881454468,
            -0.014777541160583496,
            0.13248682022094727,
            0.11131465435028076,
            -0.030705511569976807,
            0.028257787227630615,
            0.07893896102905273,
            -0.1253647804260254,
            0.0818861722946167,
            -0.024367451667785645,
            0.21405625343322754,
            -0.11114966869354248,
            0.07044178247451782,
            -0.11112672090530396,
            0.04926174879074097,
            0.03019005060195923,
            0.19632768630981445,
            0.20114237070083618,
            0.02703404426574707,
            -0.1216200590133667,
            -0.12626385688781738,
            0.13964420557022095,
            0.0711439847946167,
            -0.24677085876464844,
            0.07211446762084961,
            0.06956028938293457,
            -0.03457450866699219,
            -0.225413978099823,
            0.05093508958816528,
            0.18422341346740723,
            0.11593776941299438,
            -0.20350033044815063,
            -0.20769453048706055,
            -0.051919519901275635,
            0.0575023889541626,
            -0.10399991273880005,
            -0.20936989784240723,
            0.18721705675125122,
            -0.06249111890792847,
            -0.19768917560577393,
            -0.09643352031707764,
            0.17401015758514404,
            -0.22274762392044067,
            -0.13288593292236328,
            -0.11805450916290283,
            -0.03949415683746338,
            0.05948442220687866,
            -0.009510040283203125,
            -0.004310011863708496,
            -0.19430011510849,
            0.1465514898300171,
            -0.24375814199447632,
            -0.21551966667175293
          ],
          [
            0.14664991199970245,
            -0.28277692198753357,
            -0.13978470861911774,
            0.2260010987520218,
            -0.03217356652021408,
            -0.36929768323898315,
            -0.05518431216478348,
            -0.00805977825075388,
            -0.22039207816123962,
            -0.053425710648298264,
            -0.12337946146726608,
            0.19066017866134644,
            0.17964954674243927,
            0.13085556030273438,
            0.14904633164405823,
            -0.10091805458068848,
            -0.2285999059677124,
            -0.28476548194885254,
            -0.15858151018619537,
            0.004103326238691807,
            -0.21673397719860077,
            0.3065533936023712,
            -0.19829922914505005,
            0.2442370355129242,
            0.34916141629219055,
            -0.29457753896713257,
            -0.5147649049758911,
            -0.1377728283405304,
            0.06956486403942108,
            0.009152467362582684,
            -0.047307174652814865,
            -0.055817533284425735,
            -0.09586285799741745,
            0.4539955258369446,
            -0.1555449515581131,
            -0.12095430493354797,
            -0.2530377209186554,
            0.04496220499277115,
            -0.44839826226234436,
            0.04828367009758949,
            0.23805509507656097,
            0.38031259179115295,
            0.005257014650851488,
            -0.31142178177833557,
            0.14172495901584625,
            0.32619330286979675,
            0.44474083185195923,
            -0.29184266924858093,
            -0.09794607013463974,
            0.26565009355545044,
            -0.0695900022983551,
            0.19028793275356293,
            -0.2035309076309204,
            0.4940922260284424,
            -0.09486539661884308,
            -0.1848965585231781,
            0.40011224150657654,
            -0.3120158910751343,
            -0.1445789337158203,
            -0.0529259629547596,
            -0.381259560585022,
            0.0480349026620388,
            0.6250180602073669,
            0.24683117866516113
          ],
          [
            -0.15349780023097992,
            -0.5276908874511719,
            -0.9277746081352234,
            0.17586258053779602,
            0.1373336762189865,
            -0.21854287385940552,
            -0.0284427460283041,
            0.026425397023558617,
            0.08568818122148514,
            0.24169984459877014,
            -0.23120377957820892,
            0.03474848344922066,
            0.14139987528324127,
            -0.3820718228816986,
            -0.34360602498054504,
            -0.034568771719932556,
            0.06900026649236679,
            -0.13225512206554413,
            0.10263551026582718,
            0.03193114697933197,
            -0.8105900287628174,
            -0.49810484051704407,
            -0.828270435333252,
            -0.06354079395532608,
            -0.28951314091682434,
            -0.4524369537830353,
            -0.2681238055229187,
            0.3656941056251526,
            -0.3300350308418274,
            -0.3102799952030182,
            0.16791771352291107,
            -0.16005362570285797,
            0.19630371034145355,
            0.10685469210147858,
            0.017003381624817848,
            -0.03382283076643944,
            0.4406604766845703,
            0.06803524494171143,
            0.35229727625846863,
            0.09706559032201767,
            -0.3801726996898651,
            0.14065402746200562,
            0.26185327768325806,
            -0.4890090227127075,
            0.20053018629550934,
            0.027538897469639778,
            -0.07232488691806793,
            0.22917668521404266,
            0.05095525458455086,
            -0.05422282591462135,
            0.1784994751214981,
            -0.19024540483951569,
            -0.12900225818157196,
            0.3599989414215088,
            -0.44275838136672974,
            -0.18569695949554443,
            -0.05961674079298973,
            0.0031366923358291388,
            0.5187481045722961,
            0.014781774953007698,
            -0.23037533462047577,
            0.08723112940788269,
            0.1457538604736328,
            -0.08427666872739792
          ],
          [
            -0.3825109004974365,
            -0.2726902961730957,
            0.2096378058195114,
            -0.3025340437889099,
            -0.08024434745311737,
            -0.5229779481887817,
            0.33337849378585815,
            0.20059187710285187,
            0.05445964261889458,
            -0.02673322707414627,
            -0.4154592454433441,
            -0.33101609349250793,
            -0.18402288854122162,
            -0.004365693777799606,
            0.07242624461650848,
            -0.17335321009159088,
            0.030359787866473198,
            0.10399483144283295,
            0.35006147623062134,
            0.2716646194458008,
            -0.5122281908988953,
            -0.02911948785185814,
            -0.29913654923439026,
            0.12912043929100037,
            -0.43455109000205994,
            0.06748460233211517,
            -0.2757992148399353,
            0.15350332856178284,
            0.08989591151475906,
            -0.025184014812111855,
            0.012201201170682907,
            0.0038202577270567417,
            0.16195566952228546,
            0.04195508733391762,
            -0.0708707869052887,
            0.15794973075389862,
            0.03765908628702164,
            -0.22699610888957977,
            -0.8405570983886719,
            -0.056035228073596954,
            -0.23654796183109283,
            -0.27119168639183044,
            0.06881237030029297,
            -0.12823528051376343,
            -0.3747653365135193,
            -0.29511427879333496,
            -0.10839579254388809,
            -0.020088516175746918,
            -0.0002814330509863794,
            -0.38286566734313965,
            0.3697701394557953,
            -0.16926664113998413,
            -0.07527527958154678,
            0.2745530903339386,
            0.2666134834289551,
            -0.17345817387104034,
            -0.1950317770242691,
            -0.3222602307796478,
            -0.08971509337425232,
            0.3748560845851898,
            0.05621631070971489,
            -0.21449337899684906,
            -0.4405212998390198,
            0.20223338901996613
          ],
          [
            -0.2635659873485565,
            -0.43965211510658264,
            -0.23305512964725494,
            0.04815875366330147,
            -0.3103865385055542,
            0.5312443375587463,
            0.36651238799095154,
            -0.09626983851194382,
            0.21695463359355927,
            0.31411537528038025,
            -0.25597313046455383,
            0.10982698202133179,
            -0.3209470212459564,
            0.25123894214630127,
            -0.1249074712395668,
            -0.01976136490702629,
            -0.26257073879241943,
            0.4390469491481781,
            -0.13368257880210876,
            -0.10673343390226364,
            0.3003099858760834,
            -0.2094440758228302,
            0.4922940731048584,
            -0.7817623615264893,
            -0.045963920652866364,
            0.2544693946838379,
            -0.10696090757846832,
            -0.4691653549671173,
            0.23376744985580444,
            0.304561585187912,
            -0.1740107536315918,
            0.21380341053009033,
            0.08521746098995209,
            -0.5927845239639282,
            0.3125242292881012,
            0.050021201372146606,
            -0.8599634766578674,
            0.38601648807525635,
            -0.271640807390213,
            0.3686392605304718,
            0.4883660078048706,
            -0.25742581486701965,
            -0.3177187442779541,
            -0.10021036118268967,
            -0.5047546625137329,
            0.4864647686481476,
            -0.7417586445808411,
            0.30977267026901245,
            0.10429251939058304,
            -0.40319010615348816,
            -0.3475315570831299,
            -0.6379764676094055,
            -0.28794732689857483,
            -0.3154671788215637,
            0.03928611800074577,
            -0.05243806913495064,
            0.4313056766986847,
            -0.6194508075714111,
            0.47789791226387024,
            -0.20421306788921356,
            -0.5333885550498962,
            -0.34419354796409607,
            -0.6054786443710327,
            -0.03821476176381111
          ],
          [
            0.1636616736650467,
            -0.25821974873542786,
            0.04603690281510353,
            0.12983283400535583,
            -0.2681894600391388,
            0.039849575608968735,
            -0.045433636754751205,
            0.08102915436029434,
            0.011291121132671833,
            0.20219102501869202,
            0.010765406303107738,
            -0.02264171652495861,
            -0.01690603233873844,
            -0.0027671775314956903,
            -0.2127668410539627,
            0.38329005241394043,
            -0.010632685385644436,
            0.26817381381988525,
            0.18180544674396515,
            -0.22638224065303802,
            0.07756408303976059,
            0.10407792776823044,
            -0.19521166384220123,
            -0.015980292111635208,
            -0.3585164546966553,
            -0.2522885501384735,
            0.05336494743824005,
            -0.07396125048398972,
            0.017965013161301613,
            0.18056954443454742,
            -0.12708209455013275,
            -0.6498218774795532,
            0.322314977645874,
            -0.21206316351890564,
            0.010679070837795734,
            -0.44985124468803406,
            0.033085376024246216,
            0.20088787376880646,
            0.12881405651569366,
            -0.45976021885871887,
            -0.06568296998739243,
            -0.37699925899505615,
            0.15786100924015045,
            -0.2630161643028259,
            0.24355922639369965,
            -0.08316826075315475,
            0.08923560380935669,
            -0.2752871811389923,
            -0.45806044340133667,
            -0.014579791575670242,
            0.24950508773326874,
            -0.3585087060928345,
            0.024522854015231133,
            0.040635235607624054,
            -0.6100688576698303,
            -0.06583486497402191,
            -0.35726648569107056,
            0.11300497502088547,
            -0.15879186987876892,
            0.27847498655319214,
            0.10024140030145645,
            -0.10742519795894623,
            0.08048906177282333,
            -0.01540234312415123
          ],
          [
            -0.17718088626861572,
            -0.0038157105445861816,
            -0.22321432828903198,
            -0.0682646632194519,
            0.20524078607559204,
            -0.018744349479675293,
            -0.14770829677581787,
            -0.0958409309387207,
            0.19876503944396973,
            0.05950576066970825,
            -0.23983383178710938,
            -0.07193446159362793,
            0.014567852020263672,
            -0.21624773740768433,
            0.15750324726104736,
            -0.20932573080062866,
            -0.1843928098678589,
            0.2327343225479126,
            -0.19118010997772217,
            -0.15508514642715454,
            -0.03559613227844238,
            0.004385054111480713,
            0.1159554123878479,
            -0.08521801233291626,
            -0.06023132801055908,
            -0.05756312608718872,
            0.03322124481201172,
            0.09993541240692139,
            0.06537413597106934,
            -0.16083312034606934,
            0.1530335545539856,
            0.05089467763900757,
            -0.18384313583374023,
            -0.06746631860733032,
            0.19614571332931519,
            -0.06106078624725342,
            0.04265636205673218,
            0.21955406665802002,
            -0.09311908483505249,
            -0.23934948444366455,
            -0.21973896026611328,
            0.08497840166091919,
            0.22875773906707764,
            -0.14818710088729858,
            0.2265036702156067,
            0.08039844036102295,
            -0.2409784197807312,
            0.2440912127494812,
            -0.0032743215560913086,
            0.16364765167236328,
            0.17115193605422974,
            -0.1888551115989685,
            0.16640299558639526,
            -0.20642149448394775,
            0.13970142602920532,
            0.05400794744491577,
            0.0032675862312316895,
            0.0665317177772522,
            0.12711524963378906,
            0.07348811626434326,
            -0.24200302362442017,
            -0.08426940441131592,
            -0.10491269826889038,
            -0.2033628225326538
          ],
          [
            0.13308227062225342,
            -0.08385954797267914,
            -0.023628396913409233,
            0.19801071286201477,
            0.2293441742658615,
            -0.3537754416465759,
            -0.11633453518152237,
            -0.553528904914856,
            0.17916688323020935,
            0.2311478555202484,
            -0.20588579773902893,
            -0.23639626801013947,
            0.2596704959869385,
            -0.12560230493545532,
            -0.05563773214817047,
            -0.5007891654968262,
            0.10305137932300568,
            0.03989511728286743,
            0.010563407093286514,
            0.21332332491874695,
            0.1867879331111908,
            0.17639993131160736,
            0.10298305004835129,
            0.03536572679877281,
            -0.16361144185066223,
            0.3290412425994873,
            -0.1834440529346466,
            0.19241024553775787,
            -0.3263583481311798,
            0.005415828432887793,
            -0.14995768666267395,
            0.203404501080513,
            -0.38081684708595276,
            -0.15065698325634003,
            -0.03630140423774719,
            -0.29016292095184326,
            -1.0274673700332642,
            -0.34601980447769165,
            -0.4048401415348053,
            -0.2043399065732956,
            0.3661407232284546,
            0.0837966725230217,
            -0.01833970472216606,
            0.12423749268054962,
            0.22415529191493988,
            0.046688925474882126,
            0.2748597264289856,
            -0.18933619558811188,
            0.34919556975364685,
            -0.2963413894176483,
            0.021810516715049744,
            -0.5039289593696594,
            -0.10656270384788513,
            -0.058818500488996506,
            -0.4895075857639313,
            -0.4336257576942444,
            -0.3301064968109131,
            0.043207425624132156,
            0.04897340014576912,
            0.0147085040807724,
            0.07709585875272751,
            -0.4054087698459625,
            -0.2980448603630066,
            -0.05875084921717644
          ],
          [
            0.11006677150726318,
            -0.038763344287872314,
            0.23425710201263428,
            -0.18419551849365234,
            0.23926472663879395,
            -0.17689353227615356,
            -0.11437302827835083,
            -0.17915135622024536,
            -0.07623487710952759,
            0.24086880683898926,
            -0.054286837577819824,
            0.0258026123046875,
            0.07340991497039795,
            0.01845717430114746,
            0.17833584547042847,
            -0.24861937761306763,
            -0.11508119106292725,
            -0.07105523347854614,
            -0.17724740505218506,
            -0.17557889223098755,
            0.06618380546569824,
            -0.08030694723129272,
            0.05872243642807007,
            -0.1118539571762085,
            0.06312578916549683,
            -0.12531393766403198,
            -0.14174777269363403,
            0.21231722831726074,
            0.14932578802108765,
            -0.05654960870742798,
            0.10833084583282471,
            -0.1832115650177002,
            -0.09750622510910034,
            -0.010213851928710938,
            0.09333944320678711,
            0.23651283979415894,
            -0.24164563417434692,
            0.09314346313476562,
            0.21770650148391724,
            0.07267600297927856,
            -0.1973220705986023,
            0.11676698923110962,
            0.09564292430877686,
            0.14863258600234985,
            -0.13337910175323486,
            0.11436283588409424,
            -0.10654473304748535,
            0.2321406602859497,
            0.046596407890319824,
            0.15513116121292114,
            -0.09627479314804077,
            0.1366492509841919,
            0.1900516152381897,
            -0.10932034254074097,
            -0.06259173154830933,
            -0.18107885122299194,
            -0.14723658561706543,
            0.13074034452438354,
            0.18011820316314697,
            -0.00195920467376709,
            -0.06955087184906006,
            0.1925080418586731,
            -0.1962125301361084,
            0.12758809328079224
          ],
          [
            -0.07952338457107544,
            -0.36670827865600586,
            -0.1385938823223114,
            -0.47387203574180603,
            -0.1792263686656952,
            0.2672620713710785,
            0.15336398780345917,
            0.09090578556060791,
            -0.16734948754310608,
            -0.009070251137018204,
            -0.6535477042198181,
            0.4698788523674011,
            -0.18522566556930542,
            -0.02630344033241272,
            0.10013584792613983,
            -0.0912402868270874,
            0.24993453919887543,
            0.05690891668200493,
            0.22984139621257782,
            0.07000131905078888,
            0.006083760876208544,
            0.2527138292789459,
            0.12604260444641113,
            0.10181505978107452,
            0.0602559857070446,
            0.07503563165664673,
            -0.07618404924869537,
            0.02972136251628399,
            -0.09735424816608429,
            -0.34252166748046875,
            -0.725778341293335,
            -0.3950144946575165,
            -0.4325161576271057,
            0.21820271015167236,
            -0.5333238840103149,
            -0.045418404042720795,
            0.24506446719169617,
            0.07995515316724777,
            0.025226272642612457,
            -0.3226880133152008,
            -0.03559306636452675,
            -0.09520740061998367,
            -0.5649436712265015,
            -0.11824670433998108,
            0.02038394659757614,
            -0.012022176757454872,
            -0.159896582365036,
            -0.27638378739356995,
            0.4804990887641907,
            0.08417928218841553,
            -0.26923447847366333,
            0.011564819142222404,
            -0.3044234812259674,
            -0.2242785543203354,
            -0.13836508989334106,
            0.2671327292919159,
            0.07358617335557938,
            0.11443419754505157,
            -0.09805896133184433,
            0.2109266072511673,
            0.05260591581463814,
            0.27330923080444336,
            -0.11446966975927353,
            -0.5730294585227966
          ],
          [
            -0.3483979403972626,
            -0.35473570227622986,
            0.027085255831480026,
            -0.22164663672447205,
            -0.13239754736423492,
            0.022113598883152008,
            0.2831238806247711,
            -0.2843521535396576,
            -0.22694717347621918,
            0.1677367240190506,
            -0.24976086616516113,
            0.029558323323726654,
            0.09931351989507675,
            -0.07861263304948807,
            0.017571838572621346,
            -0.24495328962802887,
            -0.261772483587265,
            0.11383894830942154,
            0.24661150574684143,
            -0.30823490023612976,
            0.10403059422969818,
            -0.005837193690240383,
            -0.4097580313682556,
            0.03576287254691124,
            -0.012031566351652145,
            0.08088161796331406,
            -0.061390746384859085,
            0.034912604838609695,
            -0.0018250365974381566,
            0.25183573365211487,
            0.13026508688926697,
            0.16968132555484772,
            0.04847780987620354,
            -0.01908245123922825,
            0.1126604825258255,
            -0.01102114375680685,
            -0.03416166827082634,
            -0.1673131287097931,
            -0.09185905009508133,
            0.21201744675636292,
            -0.11056959629058838,
            0.020435338839888573,
            0.31907182931900024,
            -0.18591614067554474,
            -0.19654862582683563,
            -0.07149456441402435,
            0.050510846078395844,
            -0.10728752613067627,
            -0.10426932573318481,
            0.2123500108718872,
            -0.10679341852664948,
            0.009208453819155693,
            -0.47067514061927795,
            0.008703552186489105,
            0.16528894007205963,
            0.3180035650730133,
            -0.4367448091506958,
            0.052317071706056595,
            -0.21129238605499268,
            -0.12341634929180145,
            0.10871125757694244,
            0.0868191197514534,
            -0.14635279774665833,
            -0.29404670000076294
          ],
          [
            -0.07666782289743423,
            -0.5027769207954407,
            -0.3597632050514221,
            0.1446312665939331,
            -0.2271054983139038,
            -0.3852238655090332,
            -0.13940267264842987,
            -0.11740250885486603,
            0.40889307856559753,
            0.05914808437228203,
            0.16558118164539337,
            -0.1739022433757782,
            -0.13136285543441772,
            -0.0479624941945076,
            0.11627955734729767,
            -0.09731417894363403,
            -0.04099494218826294,
            0.11783835291862488,
            -0.017850730568170547,
            0.21937160193920135,
            0.4792185425758362,
            -0.22391732037067413,
            0.3541536033153534,
            -0.608944296836853,
            -0.5161004662513733,
            0.2748119533061981,
            0.13288342952728271,
            0.032245781272649765,
            0.4397410750389099,
            -0.42670533061027527,
            0.326569527387619,
            -0.012827007099986076,
            0.06312587112188339,
            -0.5458706021308899,
            0.32013165950775146,
            -0.0754302442073822,
            0.28028950095176697,
            -0.022060703486204147,
            0.5253843665122986,
            0.10269796848297119,
            -0.4186770021915436,
            -0.7399876713752747,
            0.06681416183710098,
            -0.24218764901161194,
            0.21828091144561768,
            0.6292473673820496,
            -0.9356393218040466,
            0.4546732008457184,
            0.21933229267597198,
            -0.0695468857884407,
            -0.651231586933136,
            -0.28791576623916626,
            -0.22944238781929016,
            -0.8348842859268188,
            0.15804339945316315,
            -0.020720139145851135,
            0.06698139011859894,
            0.5060343742370605,
            0.07644131779670715,
            0.12699265778064728,
            0.018426742404699326,
            0.08156321942806244,
            -0.9125332832336426,
            -0.3171103000640869
          ],
          [
            -0.2609401345252991,
            0.12901972234249115,
            -0.05795624852180481,
            -0.33944907784461975,
            -0.03570985049009323,
            0.04413820803165436,
            -0.21324753761291504,
            -0.11341007798910141,
            -0.05011456087231636,
            0.17369265854358673,
            -0.25206947326660156,
            0.11509901285171509,
            0.05445301532745361,
            -0.15120436251163483,
            -0.10027462244033813,
            0.289760559797287,
            0.40606334805488586,
            -0.018879104405641556,
            0.07493892312049866,
            0.07125914841890335,
            -0.4739162027835846,
            0.3658149242401123,
            -0.02037753537297249,
            -0.037654485553503036,
            -0.19419705867767334,
            -0.18650177121162415,
            0.3075539171695709,
            0.04443526268005371,
            -0.08923923224210739,
            0.30379718542099,
            0.22831371426582336,
            0.07334087789058685,
            0.12794028222560883,
            0.21629396080970764,
            -0.15371839702129364,
            0.12900875508785248,
            0.15740415453910828,
            0.0010278766276314855,
            0.05824670195579529,
            0.184673011302948,
            -0.15779897570610046,
            0.1388501524925232,
            0.10307145118713379,
            -0.08771758526563644,
            -0.006863745395094156,
            0.17563192546367645,
            -0.04643363133072853,
            -0.09480591863393784,
            -0.2074877768754959,
            -0.15447068214416504,
            0.24174097180366516,
            0.14141756296157837,
            -0.008925280533730984,
            -0.024182984605431557,
            0.035399679094552994,
            -0.033471520990133286,
            -0.06084636226296425,
            -0.08590734750032425,
            -0.0014027246506884694,
            -0.08495809882879257,
            0.46051087975502014,
            -0.21203041076660156,
            0.07679653912782669,
            0.10866531729698181
          ],
          [
            -0.2302372008562088,
            0.2806635797023773,
            0.19997082650661469,
            0.12956194579601288,
            0.4300740957260132,
            -0.0835430845618248,
            0.35266584157943726,
            -0.07605846226215363,
            -0.03180703520774841,
            -0.17112725973129272,
            0.02392072044312954,
            -0.20368346571922302,
            -0.1305915266275406,
            -0.2926448881626129,
            0.04254567250609398,
            -0.19648882746696472,
            -0.19510012865066528,
            -0.052194979041814804,
            -0.11883512884378433,
            0.12210137397050858,
            -0.1536700278520584,
            -0.03481198102235794,
            -0.2860225439071655,
            0.034223783761262894,
            0.19863368570804596,
            0.2216956615447998,
            0.10187400132417679,
            0.17678672075271606,
            0.18499673902988434,
            0.26957011222839355,
            -0.12059745192527771,
            0.28852584958076477,
            -0.3009932041168213,
            -0.04931024834513664,
            -0.09089311957359314,
            -0.1221463531255722,
            -0.04584410414099693,
            -0.22596029937267303,
            0.0439431257545948,
            0.17861372232437134,
            0.008514015935361385,
            0.21024249494075775,
            0.1190466657280922,
            -0.12950092554092407,
            -0.37189391255378723,
            -0.08990617841482162,
            -0.10257520526647568,
            0.11842840909957886,
            0.003918689675629139,
            -0.05020683631300926,
            -0.21989955008029938,
            -0.05031608045101166,
            -0.06148925796151161,
            0.03351060301065445,
            0.15928126871585846,
            -0.11639127880334854,
            0.2202366441488266,
            0.05941107124090195,
            0.044625423848629,
            -0.07460775971412659,
            -0.06472717225551605,
            0.12695972621440887,
            0.27758336067199707,
            0.0013450270052999258
          ],
          [
            -0.3045864999294281,
            -0.44856902956962585,
            -0.14161136746406555,
            0.0619165375828743,
            -0.08203268051147461,
            -0.9113759398460388,
            -0.16815222799777985,
            0.3367988169193268,
            0.4658539891242981,
            0.03461030125617981,
            0.22847512364387512,
            0.10931523889303207,
            0.25100579857826233,
            -0.10385672748088837,
            -0.5667403936386108,
            0.16364438831806183,
            -0.11053794622421265,
            -0.1746104657649994,
            0.12395084649324417,
            -0.8391187787055969,
            -0.0919983983039856,
            -0.00163474481087178,
            0.33363622426986694,
            0.11184970289468765,
            -0.0989302322268486,
            0.1326885223388672,
            0.30349329113960266,
            0.06277024745941162,
            0.30710291862487793,
            -0.2726762890815735,
            0.2311250865459442,
            0.39610639214515686,
            0.16128979623317719,
            0.2725242078304291,
            -0.6999807357788086,
            0.4397461414337158,
            -0.3158341944217682,
            0.0923302099108696,
            0.0017512599006295204,
            -0.16821439564228058,
