{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_4",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            32
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "dense_16_input"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_16",
          "trainable": true,
          "dtype": "float32",
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "weights": [
          [
            -0.05610444396734238,
            0.13145802915096283,
            0.17637592554092407,
            -0.13621021807193756,
            0.32286033034324646,
            -0.00197954336181283,
            0.17621883749961853,
            -0.005962174851447344,
            0.003373172599822283,
            0.16023112833499908,
            0.03563971817493439,
            -0.18000133335590363,
            -0.05078791454434395,
            0.129425048828125,
            -0.20158550143241882,
            0.08472785353660583,
            -0.10506325215101242,
            -0.2537083923816681,
            0.2750255763530731,
            0.07253371179103851,
            0.05979854241013527,
            -0.007793196942657232,
            0.07924635708332062,
            -0.028885995969176292,
            -0.17675480246543884,
            0.038325078785419464,
            0.07625356316566467,
            0.10811703652143478,
            -0.1043577492237091,
            0.18677492439746857,
            0.13568279147148132,
            -0.0994114875793457,
            -0.25220468640327454,
            0.29143214225769043,
            0.3816773593425751,
            -0.13716448843479156,
            -0.027989180758595467,
            0.04667104408144951,
            0.19293592870235443,
            0.09936171770095825,
            0.10061483830213547,
            -0.11448732763528824,
            0.2967541813850403,
            -0.008462543599307537,
            -0.1954447329044342,
            -0.1661750227212906,
            -0.039088714867830276,
            0.3299093544483185,
            0.006860499270260334,
            0.26051339507102966,
            -0.13551700115203857,
            0.2080647349357605,
            0.04559138044714928,
            -0.04556821286678314,
            -0.13034379482269287,
            0.22985170781612396,
            -0.1843341588973999,
            0.15412962436676025,
            -0.00022957834880799055,
            0.07294563204050064,
            -0.08999154716730118,
            -0.09960860759019852,
            0.14473910629749298,
            0.1967189610004425
          ],
          [
            0.3666791617870331,
            0.1396332085132599,
            -0.5174858570098877,
            -0.05921005457639694,
            0.07036636769771576,
            -0.08547522127628326,
            0.10533685237169266,
            -0.15972751379013062,
            -0.032453328371047974,
            -0.3670734763145447,
            0.340363085269928,
            0.22368574142456055,
            -0.08105818182229996,
            -0.020217563956975937,
            -0.16175749897956848,
            0.15061114728450775,
            0.1090904027223587,
            0.04826216772198677,
            0.23896759748458862,
            -0.28661882877349854,
            0.19388116896152496,
            0.05113615840673447,
            -0.5352089405059814,
            0.1751614511013031,
            0.17509537935256958,
            -0.10177543014287949,
            -0.08299502730369568,
            0.2117067128419876,
            0.2480880469083786,
            -0.0277355145663023,
            -0.0778520479798317,
            0.34228071570396423,
            0.004037715028971434,
            0.14240209758281708,
            0.2707926630973816,
            -0.26775652170181274,
            0.4492972195148468,
            0.046830739825963974,
            0.07190779596567154,
            0.2094922512769699,
            -0.34739646315574646,
            0.2467847764492035,
            -0.14557479321956635,
            0.014535626396536827,
            0.0348195843398571,
            0.13017332553863525,
            -0.1398029923439026,
            -0.20121024549007416,
            0.4990572929382324,
            0.2708240747451782,
            0.08239209651947021,
            0.11377612501382828,
            0.1199561357498169,
            -0.11321009695529938,
            -0.3165498375892639,
            0.0671052411198616,
            -0.12378751486539841,
            0.168685644865036,
            0.46315139532089233,
            -0.24112315475940704,
            0.243684783577919,
            0.11889458447694778,
            0.0807255432009697,
            -0.27005600929260254
          ],
          [
            0.05215299502015114,
            0.08204954862594604,
            0.2468479573726654,
            0.3751535415649414,
            -0.22969795763492584,
            0.017143230885267258,
            -0.41576293110847473,
            -0.07341545075178146,
            0.04635512828826904,
            0.1940746158361435,
            -0.08378864079713821,
            -0.271759957075119,
            0.16534411907196045,
            0.14902932941913605,
            -0.07533693313598633,
            0.12915365397930145,
            0.2843756079673767,
            0.04434426501393318,
            0.1225096583366394,
            0.2466198354959488,
            -0.10628731548786163,
            -0.010258072055876255,
            0.14318418502807617,
            -0.05256567522883415,
            -0.2405911237001419,
            -0.014524104073643684,
            -0.1213500127196312,
            0.11777063459157944,
            -0.14362671971321106,
            -0.006353733595460653,
            -0.30016279220581055,
            -0.0755193680524826,
            0.08000260591506958,
            0.2739354372024536,
            -0.13988544046878815,
            0.2018532156944275,
            0.24138666689395905,
            0.1826622039079666,
            0.15200696885585785,
            -0.394294798374176,
            -0.04730343818664551,
            -0.21754133701324463,
            -0.009746821597218513,
            -0.0030390818137675524,
            0.10387355834245682,
            0.3233460485935211,
            0.13235439360141754,
            0.21861715614795685,
            0.013367393054068089,
            -0.32294100522994995,
            0.18980461359024048,
            -0.13129796087741852,
            0.06718393415212631,
            0.35752707719802856,
            -0.05750521272420883,
            -0.4241471290588379,
            -0.11472620069980621,
            -0.5878102779388428,
            0.3520003855228424,
            0.17381228506565094,
            -0.18660852313041687,
            0.07830017805099487,
            0.2416921854019165,
            -0.40845975279808044
          ],
          [
            -0.1016506776213646,
            -0.4050711691379547,
            -0.05307282507419586,
            -0.020941395312547684,
            -0.008669684641063213,
            -0.11149955540895462,
            -0.18650402128696442,
            0.29695555567741394,
            -0.17711776494979858,
            -0.13453131914138794,
            0.06681636720895767,
            0.2679175138473511,
            0.26522526144981384,
            -0.18454135954380035,
            0.3865571916103363,
            -0.00017593224765732884,
            -0.148090198636055,
            -0.14837060868740082,
            -0.1985856145620346,
            -0.30602508783340454,
            0.06721317768096924,
            -0.03972281888127327,
            0.18573470413684845,
            0.2611255943775177,
            0.4141637980937958,
            0.008505219593644142,
            0.07607996463775635,
            -0.029721172526478767,
            -0.008281021378934383,
            0.1326214075088501,
            0.06544200330972672,
            -0.8062800168991089,
            -0.2547566294670105,
            0.04284198582172394,
            -0.18449580669403076,
            -0.03286178782582283,
            -0.18105745315551758,
            0.2025275081396103,
            -0.4402475953102112,
            0.40545904636383057,
            0.11405012011528015,
            0.2387537956237793,
            -0.13823039829730988,
            -0.46784716844558716,
            0.17781995236873627,
            -0.13555385172367096,
            0.27642136812210083,
            -0.35911256074905396,
            -0.060064248740673065,
            -0.1100936233997345,
            -0.07526910305023193,
            -0.1532859355211258,
            -0.30602943897247314,
            0.3369031548500061,
            0.626194953918457,
            0.04808304086327553,
            -0.00896504707634449,
            0.2658494710922241,
            -0.4313938021659851,
            0.2581543028354645,
            0.21466164290905,
            -0.03900689259171486,
            -0.2211134433746338,
            0.28789854049682617
          ],
          [
            0.13502854108810425,
            -0.24027907848358154,
            0.16635176539421082,
            0.4318419098854065,
            -0.014257117174565792,
            -0.08205482363700867,
            -0.18085503578186035,
            -0.14664429426193237,
            0.05768074095249176,
            -0.04453052952885628,
            0.268506795167923,
            0.18390075862407684,
            -0.2570670247077942,
            0.01387165766209364,
            0.02787327766418457,
            0.10595530271530151,
            0.03294426575303078,
            -0.15071195363998413,
            -0.12590360641479492,
            0.38413161039352417,
            0.11221927404403687,
            0.13582782447338104,
            0.1774006336927414,
            0.20446836948394775,
            -0.06922535598278046,
            -0.10897892713546753,
            0.06794832646846771,
            -0.05219096690416336,
            -0.555181086063385,
            0.17903366684913635,
            0.24797683954238892,
            -0.08692359924316406,
            -0.17163312435150146,
            0.09443569928407669,
            -0.18647819757461548,
            -0.08941823244094849,
            0.0030343986582010984,
            -0.10252335667610168,
            0.3380824327468872,
            -0.01712414249777794,
            0.04250061511993408,
            -0.3207961320877075,
            -0.006074169185012579,
            0.45554354786872864,
            -0.20392121374607086,
            -0.16317063570022583,
            -0.02498183771967888,
            -0.41558921337127686,
            -0.042498279362916946,
            0.31064313650131226,
            -0.23315425217151642,
            0.04242732375860214,
            0.0722709372639656,
            -0.06815478950738907,
            0.20709729194641113,
            -0.03585338592529297,
            -0.5740228891372681,
            -0.4610900580883026,
            -0.08417902886867523,
            -0.1176912784576416,
            -0.22513827681541443,
            -0.012385178357362747,
            0.26366013288497925,
            -0.1071806326508522
          ],
          [
            0.10481128841638565,
            0.08540014177560806,
            0.030713994055986404,
            0.23095650970935822,
            -0.24622535705566406,
            0.17744554579257965,
            0.3306535482406616,
            0.2891058027744293,
            0.1554695963859558,
            0.117347352206707,
            -0.017286529764533043,
            -0.37677064538002014,
            0.04936769977211952,
            0.15695272386074066,
            -0.2923049032688141,
            0.2613193988800049,
            0.14837045967578888,
            -0.07996634393930435,
            -0.08903098106384277,
            -0.11527913063764572,
            -0.1165793240070343,
            -0.08742403984069824,
            0.16557453572750092,
            0.46881863474845886,
            0.23534154891967773,
            0.06380803883075714,
            0.15567491948604584,
            0.08747009932994843,
            0.2549990713596344,
            0.07223660498857498,
            0.2059488743543625,
            0.030636228621006012,
            0.1288323998451233,
            0.3480033278465271,
            -0.028939291834831238,
            0.5649945735931396,
            -0.3480522036552429,
            -0.051930274814367294,
            0.16181017458438873,
            -0.009572708047926426,
            0.24432852864265442,
            -0.22015652060508728,
            -0.1843792200088501,
            -0.22674626111984253,
            0.22817590832710266,
            -0.12230825424194336,
            0.3810614347457886,
            0.11376740783452988,
            -0.04083479568362236,
            -0.37407946586608887,
            0.4153038263320923,
            -0.5085753202438354,
            -0.08665325492620468,
            -0.28256580233573914,
            -0.07504509389400482,
            -0.16674013435840607,
            -0.22225971519947052,
            0.21600906550884247,
            -0.0013621902326121926,
            0.10474047064781189,
            0.24268996715545654,
            -0.17126435041427612,
            -0.04518401622772217,
            -0.005653075873851776
          ],
          [
            0.25977855920791626,
            0.22252978384494781,
            0.10354123264551163,
            0.16817834973335266,
            -0.2723125219345093,
            0.05644280090928078,
            -0.4048011004924774,
            0.2687458395957947,
            0.13701312243938446,
            0.15213367342948914,
            -0.5071044564247131,
            0.23934610188007355,
            0.1869659274816513,
            -0.34452158212661743,
            0.25774040818214417,
            0.18749834597110748,
            0.2983456552028656,
            0.19040781259536743,
            -0.12126894295215607,
            -0.005396382883191109,
            0.6202782988548279,
            -0.0979309007525444,
            0.29931509494781494,
            -0.5168834924697876,
            -0.1956261694431305,
            0.06599123030900955,
            -0.4303041100502014,
            -0.18661350011825562,
            0.15735790133476257,
            -0.18232958018779755,
            -0.24891780316829681,
            0.46407002210617065,
            0.03828585892915726,
            -0.261216938495636,
            -0.041256170719861984,
            -0.12210383266210556,
            -0.1296745389699936,
            0.2515000104904175,
            -0.13609842956066132,
            0.18095199763774872,
            0.1627783626317978,
            0.32117676734924316,
            0.11075019836425781,
            -0.0862705335021019,
            0.047639619559049606,
            -0.46943265199661255,
            0.2345452606678009,
            -0.21626241505146027,
            0.4620853662490845,
            -0.2143738567829132,
            0.004242926370352507,
            -0.16652798652648926,
            -0.18006934225559235,
            0.13324840366840363,
            -0.21733762323856354,
            0.11090938001871109,
            0.26703259348869324,
            -0.2528254985809326,
            0.14911186695098877,
            0.43695905804634094,
            -0.21445226669311523,
            -0.25496286153793335,
            0.3176789879798889,
            0.09916160255670547
          ],
          [
            0.022587014362215996,
            -0.32829397916793823,
            0.12616974115371704,
            -0.23852258920669556,
            0.14641885459423065,
            0.18208439648151398,
            0.4329071044921875,
            -0.21652325987815857,
            0.14094328880310059,
            0.09595988690853119,
            0.31538093090057373,
            0.34082433581352234,
            0.11811866611242294,
            0.22657088935375214,
            -0.48530200123786926,
            -0.0915609672665596,
            -0.08880507946014404,
            -0.08403313159942627,
            -0.04149945452809334,
            0.10357049107551575,
            0.23052242398262024,
            -0.01799444481730461,
            0.4291769862174988,
            -0.00877075269818306,
            -0.20677345991134644,
            -0.3816133737564087,
            -0.014002352952957153,
            -0.16537582874298096,
            0.16886501014232635,
            0.11679848283529282,
            -0.41285672783851624,
            -0.1650252491235733,
            -0.6066604852676392,
            -0.16483712196350098,
            -0.1351599246263504,
            -0.07031743973493576,
            -0.08180444687604904,
            0.15275153517723083,
            0.12550505995750427,
            -0.24063217639923096,
            0.4170610010623932,
            -0.12112800031900406,
            0.08581490069627762,
            0.021668588742613792,
            -0.3072298467159271,
            -0.05854817479848862,
            -0.20732325315475464,
            -0.1313050240278244,
            0.27904242277145386,
            0.27787572145462036,
            0.18457263708114624,
            0.2476949691772461,
            0.43057817220687866,
            0.3235090672969818,
            -0.21238701045513153,
            -0.0986771285533905,
            -0.04845663532614708,
            0.22329699993133545,
            0.15236921608448029,
            -0.17648907005786896,
            0.38000982999801636,
            0.17184850573539734,
            0.3416956961154938,
            -0.4585331976413727
          ],
          [
            0.10094910860061646,
            0.16261941194534302,
            -0.12948960065841675,
            0.026722848415374756,
            -0.21634536981582642,
            0.12226766347885132,
            -0.2344263195991516,
            0.06604242324829102,
            0.24701428413391113,
            -0.2201865315437317,
            0.21806782484054565,
            -0.16224026679992676,
            -0.045452654361724854,
            -0.16312271356582642,
            0.09595602750778198,
            -0.12319129705429077,
            0.03743886947631836,
            0.1700325608253479,
            -0.20843499898910522,
            -0.18358689546585083,
            -0.24796843528747559,
            0.0028628110885620117,
            0.0712965726852417,
            -0.12393611669540405,
            -0.17750853300094604,
            -0.24911487102508545,
            -0.22726064920425415,
            -0.14633363485336304,
            0.09325075149536133,
            0.02757972478866577,
            0.0040495991706848145,
            -0.2174067497253418,
            0.18846213817596436,
            -0.2228507399559021,
            0.19923579692840576,
            -0.13698935508728027,
            -0.08740741014480591,
            -0.10201680660247803,
            0.11804038286209106,
            0.1768142580986023,
            -0.04258686304092407,
            0.10248863697052002,
            -0.18562477827072144,
            -0.1455904245376587,
            0.179976224899292,
            0.078605055809021,
            -0.14101719856262207,
            -0.1944129467010498,
            -0.025558650493621826,
            -0.10418063402175903,
            -0.014030754566192627,
            0.09392982721328735,
            -0.18807119131088257,
            0.16917705535888672,
            0.02817600965499878,
            -0.17912590503692627,
            0.03040027618408203,
            -0.1787993311882019,
            0.08808660507202148,
            -0.20205801725387573,
            0.11925774812698364,
            -0.08071976900100708,
            0.007649362087249756,
            -0.18955522775650024
          ],
          [
            0.008442044258117676,
            -0.057828664779663086,
            0.022125184535980225,
            -0.12320369482040405,
            0.039423584938049316,
            0.23404651880264282,
            0.043132245540618896,
            0.2356136441230774,
            0.03143793344497681,
            0.2006523609161377,
            -0.03158271312713623,
            -0.11742115020751953,
            -0.005808055400848389,
            0.22913718223571777,
            -0.23442673683166504,
            0.010061442852020264,
            0.2164408564567566,
            0.18745386600494385,
            0.047645628452301025,
            -0.19665616750717163,
            -0.16794776916503906,
            -0.14430838823318481,
            -0.029562711715698242,
            0.050608277320861816,
            -0.23867851495742798,
            0.1845717430114746,
            0.06969594955444336,
            -0.05153024196624756,
            -0.08562082052230835,
            0.05880206823348999,
            -0.034343600273132324,
            0.09275925159454346,
            -0.07805168628692627,
            -0.10262918472290039,
            -0.03032737970352173,
            0.031141817569732666,
            -0.23326176404953003,
            -0.22157913446426392,
            -0.24203020334243774,
            0.01387333869934082,
            0.0547175407409668,
            0.22346246242523193,
            0.13333994150161743,
            0.08318114280700684,
            0.06436014175415039,
            0.10498791933059692,
            0.15291976928710938,
            -0.1375330090522766,
            0.15956056118011475,
            -0.011932730674743652,
            -0.2375543713569641,
            -0.20009851455688477,
            -0.16363197565078735,
            0.09514176845550537,
            0.10045802593231201,
            -0.0034213662147521973,
            0.1445346474647522,
            0.06932109594345093,
            -0.21897560358047485,
            0.18347078561782837,
            0.2438564896583557,
            -0.038532376289367676,
            0.07816022634506226,
            0.034847378730773926
          ],
          [
            0.014856219291687012,
            0.17097675800323486,
            0.2342401146888733,
            -0.0644993782043457,
            -0.011316537857055664,
            0.147649347782135,
            0.18687880039215088,
            -0.15504920482635498,
            0.037225961685180664,
            -0.12875109910964966,
            0.21009176969528198,
            -0.0896562933921814,
            -0.0858149528503418,
            0.1647660732269287,
            0.13070034980773926,
            -0.009064018726348877,
            0.02415299415588379,
            -0.03646034002304077,
            0.14577049016952515,
            0.012433052062988281,
            0.16708087921142578,
            -0.20671391487121582,
            0.20527058839797974,
            0.10785764455795288,
            -0.16982704401016235,
            -0.0257265567779541,
            0.04737138748168945,
            0.24810874462127686,
            0.025651752948760986,
            0.018807590007781982,
            -0.030952632427215576,
            0.23492282629013062,
            -0.06362497806549072,
            0.1887243390083313,
            0.15941143035888672,
            -0.18914735317230225,
            -0.18036025762557983,
            0.06882691383361816,
            0.021657168865203857,
            0.01742100715637207,
            0.12818145751953125,
            -0.15886926651000977,
            0.1614707112312317,
            -0.0692242980003357,
            0.19274252653121948,
            0.2326948642730713,
            -0.07146549224853516,
            -0.13988125324249268,
            -0.06525486707687378,
            0.06604379415512085,
            -0.15819823741912842,
            0.0327608585357666,
            -0.10781490802764893,
            -0.0529438853263855,
            -0.11950242519378662,
            -0.03490060567855835,
            -0.22908258438110352,
            0.10875338315963745,
            -0.1312500238418579,
            -0.14176571369171143,
            0.16692125797271729,
            0.0777321457862854,
            0.018195390701293945,
            -0.022673428058624268
          ],
          [
            0.1714303344488144,
            0.1449032872915268,
            -0.15328556299209595,
            -0.16183681786060333,
            0.02914091944694519,
            -0.06302258372306824,
            -0.10795705020427704,
            -0.4074138402938843,
            0.5641915202140808,
            -0.08476623892784119,
            0.09201043844223022,
            -0.07149975001811981,
            0.042932018637657166,
            -0.45523566007614136,
            0.05258554220199585,
            0.32751694321632385,
            0.06791951507329941,
            0.0014685392379760742,
            -0.24419444799423218,
            0.04580225050449371,
            -0.3406132161617279,
            -0.17197294533252716,
            -0.09059853851795197,
            -0.2372681349515915,
            0.10161365568637848,
            -0.27612754702568054,
            0.19717471301555634,
            -0.363139808177948,
            0.19416794180870056,
            0.1393471211194992,
            -0.31236034631729126,
            0.08791956305503845,
            -0.19372396171092987,
            0.2603640556335449,
            0.08872638642787933,
            -0.06818460673093796,
            -0.04039962589740753,
            0.08817780762910843,
            0.01604440063238144,
            -0.2868403494358063,
            -0.22422228753566742,
            -0.24155886471271515,
            0.07300964742898941,
            -0.08404067158699036,
            -0.23514363169670105,
            0.21481245756149292,
            -0.18814262747764587,
            0.17505007982254028,
            -0.27161601185798645,
            0.007663661614060402,
            -0.11222254484891891,
            -0.12029989808797836,
            -0.14586187899112701,
            0.3513830304145813,
            -0.09080198407173157,
            0.12722040712833405,
            0.266377717256546,
            0.6914794445037842,
            -0.16383981704711914,
            0.07129553705453873,
            0.0042405459098517895,
            0.3182660937309265,
            -0.4637087881565094,
            0.2485363781452179
          ],
          [
            0.04445432499051094,
            -0.6157771944999695,
            -0.1418573260307312,
            0.13904282450675964,
            0.061323780566453934,
            -0.21476897597312927,
            0.20224308967590332,
            0.042201850563287735,
            -0.14935989677906036,
            0.2217358499765396,
            -0.2746492624282837,
            -0.003053048625588417,
            0.010637307539582253,
            0.3442791998386383,
            -0.08728177100419998,
            -0.18740636110305786,
            0.12148813158273697,
            -0.022124996408820152,
            -0.36705997586250305,
            -0.11040869355201721,
            0.13708719611167908,
            0.08152246475219727,
            0.13832300901412964,
            0.023170122876763344,
            0.07278627902269363,
            0.04718074947595596,
            0.11518419533967972,
            0.293953001499176,
            -0.31283968687057495,
            -0.24194253981113434,
            0.16372540593147278,
            0.08331679552793503,
            0.15201206505298615,
            -0.24732138216495514,
            -0.26922178268432617,
            0.1676221340894699,
            0.11970207095146179,
            0.1417243331670761,
            -0.16345557570457458,
            0.18583567440509796,
            0.10981893539428711,
            0.021397441625595093,
            0.04337581619620323,
            0.19096200168132782,
            -0.06265430897474289,
            0.034136753529310226,
            0.08049236983060837,
            -0.17033854126930237,
            0.00500964280217886,
            -0.11004968732595444,
            -0.3033536672592163,
            -0.10878607630729675,
            0.034031517803668976,
            -0.19616539776325226,
            0.09233389049768448,
            0.399646133184433,
            0.015608727000653744,
            -0.19465573132038116,
            -0.17157098650932312,
            -0.16182219982147217,
            0.2592031955718994,
            -0.32121336460113525,
            -0.22789666056632996,
            0.040144018828868866
          ],
          [
            -0.08849892765283585,
            0.27862948179244995,
            0.22355960309505463,
            -0.1810397505760193,
            -0.458065927028656,
            -0.3175660967826843,
            -0.06756282597780228,
            -0.41234084963798523,
            -0.41385990381240845,
            -0.06374870240688324,
            0.2560500502586365,
            0.4116624891757965,
            0.12665481865406036,
            -0.07534796744585037,
            -0.36656439304351807,
            -0.10390260815620422,
            0.12712761759757996,
            -0.0887351706624031,
            -0.062261223793029785,
            0.3182450830936432,
            0.09195337444543839,
            -0.10331767797470093,
            0.04525906592607498,
            -0.11088478565216064,
            0.0017625805921852589,
            -0.3102708160877228,
            -0.07776301354169846,
            -0.06564789265394211,
            -0.016028067097067833,
            -0.0739414170384407,
            0.024928314611315727,
            -0.24897266924381256,
            0.5610131025314331,
            -0.08916079998016357,
            -0.1311819702386856,
            0.22370851039886475,
            -0.5502522587776184,
            -0.0798785462975502,
            0.20624902844429016,
            0.3677026927471161,
            -0.206170454621315,
            0.27040910720825195,
            -0.190962553024292,
            0.5084890127182007,
            0.008641684427857399,
            0.021346168592572212,
            -0.43856990337371826,
            -0.11757617443799973,
            -0.33992287516593933,
            -0.11679218709468842,
            0.15876664221286774,
            -0.19112670421600342,
            -0.074875608086586,
            0.34147435426712036,
            0.040155522525310516,
            0.23736967146396637,
            0.04860544949769974,
            -0.391501784324646,
            0.1315838098526001,
            -0.18128317594528198,
            0.17582637071609497,
            -0.3068212866783142,
            -0.09334845840930939,
            -0.33096668124198914
          ],
          [
            -0.1439441293478012,
            0.1053527221083641,
            -0.1545136719942093,
            -0.19501227140426636,
            0.17693492770195007,
            -0.07846476882696152,
            0.18936364352703094,
            0.009004504419863224,
            0.3560984432697296,
            -0.04124131426215172,
            0.17238523066043854,
            -0.15185192227363586,
            0.18196149170398712,
            0.3267171084880829,
            -0.6183982491493225,
            -0.3350169360637665,
            0.03496953099966049,
            0.1272275745868683,
            0.14884743094444275,
            0.0808037742972374,
            -0.34235721826553345,
            0.08881592005491257,
            -0.1702101081609726,
            0.13937538862228394,
            0.11231805384159088,
            -0.08143573254346848,
            -0.015340594574809074,
            0.23102080821990967,
            0.33057522773742676,
            0.18363404273986816,
            0.16590476036071777,
            -0.041010551154613495,
            0.19612719118595123,
            0.11379052698612213,
            -0.29199302196502686,
            0.14845336973667145,
            0.010715984739363194,
            0.11051527410745621,
            -0.42412832379341125,
            -0.20513683557510376,
            -0.2527449131011963,
            -0.08478403091430664,
            -0.2946764826774597,
            0.006712999660521746,
            -0.054840896278619766,
            0.06770136952400208,
            0.08031411468982697,
            0.11690863966941833,
            -0.14007356762886047,
            0.14692336320877075,
            0.09490849077701569,
            -0.18363521993160248,
            0.13138261437416077,
            -0.036072831600904465,
            0.06349041312932968,
            0.006454841699451208,
            -0.38685548305511475,
            0.09002415835857391,
            -0.01205775048583746,
            -0.1767456978559494,
            0.046227145940065384,
            0.40665069222450256,
            -0.12997713685035706,
            -0.14564628899097443
          ],
          [
            0.027850113809108734,
            0.15328726172447205,
            0.0739167258143425,
            -0.062428705394268036,
            -0.21397997438907623,
            -0.058373793959617615,
            -0.18409836292266846,
            -0.1359683722257614,
            0.2419116348028183,
            0.2032075673341751,
            0.1818779557943344,
            -0.12430897355079651,
            -0.2214510291814804,
            -0.46126461029052734,
            0.5008975863456726,
            -0.4320183992385864,
            0.17760181427001953,
            -0.22436068952083588,
            0.09832443296909332,
            0.13886933028697968,
            -0.21224217116832733,
            -0.30975341796875,
            0.017213713377714157,
            0.18964464962482452,
            0.026893706992268562,
            0.32772454619407654,
            0.09866499155759811,
            -0.6118565201759338,
            0.22129061818122864,
            0.018927497789263725,
            -0.28949877619743347,
            0.4006308615207672,
            -0.26612451672554016,
            -0.351207971572876,
            -0.7693290710449219,
            0.18593882024288177,
            -0.24285387992858887,
            0.24176958203315735,
            0.13714191317558289,
            -0.08999072015285492,
            -0.6170700788497925,
            0.21446585655212402,
            -0.3038906753063202,
            -0.28714707493782043,
            -0.08941975980997086,
            -0.3533172309398651,
            0.005896904040127993,
            -0.011233707889914513,
            0.0957036092877388,
            0.0690097063779831,
            0.3692513108253479,
            0.008407553657889366,
            -0.025860603898763657,
            0.07929892838001251,
            -0.10718633234500885,
            -0.15412525832653046,
            -0.4384089708328247,
            -0.1478600949048996,
            -0.16103637218475342,
            -0.07649900019168854,
            -0.01263035275042057,
            -0.22442062199115753,
            -0.0334603413939476,
            0.2853252589702606
          ],
          [
            -0.0852777287364006,
            -0.16262230277061462,
            0.1433294713497162,
            0.27485454082489014,
            0.12395557761192322,
            -0.006071903742849827,
            -0.019219987094402313,
            -0.09406930953264236,
            0.12073904275894165,
            -0.5668630003929138,
            0.11477065831422806,
            0.1722656786441803,
            0.048103269189596176,
            -0.09930774569511414,
            -0.012837248854339123,
            0.0854836106300354,
            0.04803774505853653,
            -0.05185693874955177,
            -0.17630551755428314,
            0.12530499696731567,
            -0.33564671874046326,
            0.31580814719200134,
            0.05084453150629997,
            -0.2840987741947174,
            -0.01108214445412159,
            -0.1533423364162445,
            0.2861400842666626,
            -0.040627315640449524,
            -0.05800838768482208,
            0.11157145351171494,
            -0.32537996768951416,
            -0.06905359774827957,
            -0.21092495322227478,
            0.18669314682483673,
            -0.3243089020252228,
            0.13407890498638153,
            -0.20880208909511566,
            -0.06127459928393364,
            0.22560781240463257,
            -0.25439924001693726,
            -0.15073421597480774,
            -0.031044937670230865,
            -0.13983070850372314,
            0.060960251837968826,
            0.2636483907699585,
            -0.15105272829532623,
            -0.08575531095266342,
            0.10561566054821014,
            -0.16678635776042938,
            -0.45297273993492126,
            0.26711517572402954,
            0.08529958128929138,
            -0.24443930387496948,
            0.1963815987110138,
            -0.20880064368247986,
            0.2355266809463501,
            0.20692557096481323,
            -0.10692274570465088,
            0.007544126361608505,
            -0.2779207229614258,
            0.15494751930236816,
            0.06978131085634232,
            0.12767405807971954,
            0.2121465504169464
          ],
          [
            0.24177493155002594,
            -0.21733780205249786,
            0.3665612041950226,
            -0.06411674618721008,
            -0.034086938947439194,
            0.010264362208545208,
            -0.13707780838012695,
            -0.37602779269218445,
            0.2533018887042999,
            -0.047237578779459,
            -0.37520918250083923,
            0.507586658000946,
            -0.07934343814849854,
            0.05072790011763573,
            -0.15508192777633667,
            0.17778311669826508,
            -0.11732245981693268,
            -0.18405963480472565,
            0.07440001517534256,
            -0.7162258625030518,
            -0.2905026078224182,
            0.20947270095348358,
            0.08065640181303024,
            0.1054258868098259,
            0.14488168060779572,
            -0.08916569501161575,
            -0.480116605758667,
            -0.24911744892597198,
            0.024340670555830002,
            -0.02601524628698826,
            -0.077913798391819,
            0.08605051040649414,
            0.17787529528141022,
            -0.17816856503486633,
            -0.18776290118694305,
            0.13958901166915894,
            0.3299464285373688,
            0.03933938965201378,
            0.12525977194309235,
            -0.05305042862892151,
            0.006649564485996962,
            0.26108813285827637,
            -0.1986466348171234,
            0.06576620042324066,
            -0.13002793490886688,
            0.07885795831680298,
            -0.022179607301950455,
            -0.257727712392807,
            0.041576337069272995,
            0.29160788655281067,
            0.3067161738872528,
            -0.298417329788208,
            0.38685426115989685,
            -0.001396783860400319,
            0.09404376149177551,
            -0.0917363092303276,
            -0.28114035725593567,
            -0.06508219242095947,
            0.049729473888874054,
            -0.08722200244665146,
            -0.09581374377012253,
            0.27458974719047546,
            -0.06972699612379074,
            -0.2603347599506378
          ],
          [
            0.22945807874202728,
            0.028072146698832512,
            -0.2895914614200592,
            -0.4621143937110901,
            0.2311391532421112,
            0.10080878436565399,
            -0.30841222405433655,
            -0.27568480372428894,
            -0.019807571545243263,
            0.15435320138931274,
            0.08321546763181686,
            0.06252079457044601,
            -0.19851060211658478,
            -0.24886949360370636,
            0.1487302929162979,
            0.04601993039250374,
            0.1169663742184639,
            -0.25080257654190063,
            0.2512536644935608,
            -0.010136482305824757,
            0.3247849941253662,
            0.035454537719488144,
            -0.09009071439504623,
            0.1160394698381424,
            0.18312178552150726,
            0.05054131895303726,
            -0.06243390217423439,
            -0.38762331008911133,
            0.1374496966600418,
            0.17628511786460876,
            -0.46424105763435364,
            -0.09258005023002625,
            0.4113616347312927,
            0.24300698935985565,
            0.14539341628551483,
            0.10125364363193512,
            -0.022302767261862755,
            -0.32671424746513367,
            0.14622445404529572,
            0.0028392025269567966,
            -0.20299620926380157,
            -0.16303817927837372,
            -0.14685532450675964,
            -0.06645779311656952,
            0.2825392484664917,
            -0.19024202227592468,
            -0.1428190916776657,
            0.3199683129787445,
            -0.711574137210846,
            -0.10151273757219315,
            0.00484813516959548,
            -0.01421534176915884,
            -0.10031580179929733,
            -0.4426134526729584,
            -0.05789296329021454,
            -0.3266187310218811,
            0.3625169098377228,
            -0.27962416410446167,
            -0.05589713528752327,
            0.15716968476772308,
            0.3085375130176544,
            0.33032840490341187,
            -0.38706302642822266,
            0.05144577473402023
          ],
          [
            -0.2724591791629791,
            0.07648089528083801,
            0.06508521735668182,
            0.09770441800355911,
            -0.26573869585990906,
            0.09390028566122055,
            0.0020022273529320955,
            -0.0030688652768731117,
            0.01923404075205326,
            -0.24537640810012817,
            0.1592247486114502,
            0.0612458810210228,
            0.08876070380210876,
            -0.4232458174228668,
            0.018083708360791206,
            -0.4196408689022064,
            -0.20115697383880615,
            -0.1555420607328415,
            -0.029506323859095573,
            -0.11918189376592636,
            -0.49242377281188965,
            -0.03305770456790924,
            -0.31971868872642517,
            -0.37380701303482056,
            0.032604049891233444,
            0.09785091131925583,
            0.09856239706277847,
            -0.19876989722251892,
            0.27292150259017944,
            -0.07685168087482452,
            -0.09083998948335648,
            -0.09385250508785248,
            0.11576065421104431,
            0.08019604533910751,
            0.06328532099723816,
            -0.046339768916368484,
            0.34841388463974,
            -0.266315758228302,
            0.2344866394996643,
            -0.15402443706989288,
            -0.5594885349273682,
            -0.19472716748714447,
            -0.19244568049907684,
            -0.0008917959639802575,
            0.17895251512527466,
            0.17138180136680603,
            0.3751852810382843,
            -0.12437745928764343,
            -0.07219219207763672,
            -0.2103501856327057,
            -0.11384157091379166,
            0.21954169869422913,
            -0.2641684114933014,
            -0.22122660279273987,
            -0.4929775893688202,
            0.02709784545004368,
            0.046783849596977234,
            0.04970654845237732,
            0.28395676612854004,
            0.042528603225946426,
            0.16185791790485382,
            0.3161805272102356,
            0.3125428855419159,
            -0.11446970701217651
          ],
          [
            0.2735305428504944,
            0.00013457532622851431,
            0.20149140059947968,
            0.08551807701587677,
            -0.06912492215633392,
            0.053476084023714066,
            -0.08596890419721603,
            0.27944305539131165,
            0.1395261585712433,
            -0.0849224328994751,
            0.044177912175655365,
            0.03446866571903229,
            -0.0022255422081798315,
            0.043035756796598434,
            -0.14250370860099792,
            -0.11704882234334946,
            0.2823260724544525,
            0.025049269199371338,
            -0.3834713101387024,
            -0.053574975579977036,
            -0.013432081788778305,
            -0.25940096378326416,
            -0.08856201171875,
            0.03781303018331528,
            0.15502196550369263,
            -0.215393528342247,
            0.0837189257144928,
            0.038640644401311874,
            0.2147732824087143,
            -0.2414853870868683,
            0.007550796028226614,
            -0.5847988128662109,
            0.18752270936965942,
            -0.024106428027153015,
            -0.28505760431289673,
            -0.1530640721321106,
            -0.23533190786838531,
            -0.409645140171051,
            -0.20567789673805237,
            0.21724972128868103,
            -0.3640083372592926,
            0.22546526789665222,
            0.23668380081653595,
            0.32117152214050293,
            -0.061452269554138184,
            0.24926741421222687,
            0.07676201313734055,
            -0.13002119958400726,
            0.20069237053394318,
            -0.05303121730685234,
            0.19019320607185364,
            0.21962013840675354,
            -0.03507596254348755,
            -0.020791690796613693,
            -0.08234511315822601,
            0.016506928950548172,
            -0.07692673802375793,
            -0.11045460402965546,
            -0.20217157900333405,
            -0.06927081197500229,
            0.04795742407441139,
            -0.01355349738150835,
            0.16090203821659088,
            -0.08471634984016418
          ],
          [
            -0.018683956936001778,
            -0.30012810230255127,
            0.025773130357265472,
            0.10796628147363663,
            -0.13384056091308594,
            -0.027125118300318718,
            -0.23360976576805115,
            -0.3026144504547119,
            0.0070863463915884495,
            -0.029259229078888893,
            -0.18194109201431274,
            -0.11741318553686142,
            -0.45405638217926025,
            -0.3059908449649811,
            0.1955844610929489,
            -0.3411826193332672,
            0.06123858317732811,
            0.05770130828022957,
            0.0651586577296257,
            -0.3036382794380188,
            0.08322452753782272,
            0.033305276185274124,
            -0.26961931586265564,
            0.2218886762857437,
            -0.07890696823596954,
            -0.15168961882591248,
            -0.14393046498298645,
            0.16557443141937256,
            0.15524297952651978,
            -0.6476497054100037,
            0.10120771825313568,
            -0.1948545128107071,
            -0.19054681062698364,
            0.13681553304195404,
            0.0930081456899643,
            0.07564907521009445,
            -0.18128931522369385,
            0.21441081166267395,
            0.006848362740129232,
            0.05184602737426758,
            -0.00491921603679657,
            0.02956293523311615,
            0.03098498284816742,
            0.02479991316795349,
            0.2613219618797302,
            0.18474073708057404,
            0.04495437443256378,
            0.15400350093841553,
            -0.2408154159784317,
            0.10106287896633148,
            -0.3161754608154297,
            0.04652298986911774,
            0.2023279368877411,
            -0.20440644025802612,
            0.0436440035700798,
            -0.3849557936191559,
            0.18894419074058533,
            -0.11852283775806427,
            -0.0671691745519638,
            0.03857697546482086,
            -0.3103824257850647,
            0.2918437123298645,
            -0.20369824767112732,
            0.35112127661705017
          ],
          [
            -0.009170351549983025,
            -0.018869634717702866,
            0.028059419244527817,
            -0.31900322437286377,
            -0.02929634600877762,
            -0.30443695187568665,
            -0.006107148248702288,
            0.1814814954996109,
            -0.4790533483028412,
            0.15048359334468842,
            0.15266099572181702,
            -0.1468532383441925,
            0.09890953451395035,
            0.035586725920438766,
            -0.25722596049308777,
            -0.00927642174065113,
            0.13933266699314117,
            -0.060163140296936035,
            0.18711034953594208,
            0.0023886547423899174,
            -0.24662543833255768,
            -0.15443462133407593,
            0.21058562397956848,
            0.07905911654233932,
            0.15362714231014252,
            -0.21424949169158936,
            0.02500923164188862,
            -0.325046181678772,
            0.04237401485443115,
            -0.17078939080238342,
            0.1409418135881424,
            -0.281338095664978,
            0.03453059121966362,
            -0.30080971121788025,
            0.011088640429079533,
            -0.06227952241897583,
            -0.22200961410999298,
            -0.19789795577526093,
            0.20521852374076843,
            0.1768103986978531,
            -0.2291279435157776,
            -0.036218371242284775,
