{
  "class_name": "Sequential",
  "config": {
    "name": "sequential",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            32
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "dense_input"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": "float32",
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "weights": [
          [
            0.137899711728096,
            0.10725989192724228,
            -0.15346506237983704,
            -0.11292126029729843,
            -0.29258331656455994,
            0.09972754865884781,
            -0.1556175798177719,
            -0.025050466880202293,
            0.150154247879982,
            -0.24175719916820526,
            0.06473740190267563,
            -0.20363876223564148,
            -0.003307626349851489,
            -0.17563378810882568,
            -0.05562429130077362,
            -0.003979119472205639,
            0.09219446033239365,
            0.15321049094200134,
            0.0159757062792778,
            0.3692675530910492,
            0.2661868631839752,
            -0.19849833846092224,
            0.2887381911277771,
            -0.17798098921775818,
            0.06308034062385559,
            -0.10719883441925049,
            0.2325984090566635,
            -0.17961135506629944,
            0.3919437527656555,
            -0.14308349788188934,
            0.04218507558107376,
            0.015964336693286896,
            -0.09975581616163254,
            0.21623285114765167,
            -0.21218401193618774,
            -0.030987346544861794,
            -0.07251468300819397,
            -0.26378411054611206,
            -0.4684782326221466,
            -0.14159350097179413,
            -0.19176672399044037,
            0.30646181106567383,
            -0.34300798177719116,
            0.3085070252418518,
            0.2521796226501465,
            0.0624394528567791,
            -0.5093509554862976,
            -0.479595810174942,
            0.09605563431978226,
            0.06550892442464828,
            -0.20238809287548065,
            -0.28863784670829773,
            0.3034136891365051,
            -0.1352834850549698,
            -0.17999620735645294,
            0.0889992043375969,
            0.2571899890899658,
            -0.39812490344047546,
            0.2061508595943451,
            -0.18429769575595856,
            -0.16562390327453613,
            0.06059882044792175,
            -0.08708715438842773,
            -0.11818871647119522
          ],
          [
            0.11521925032138824,
            0.047906991094350815,
            0.28454601764678955,
            0.2475796937942505,
            0.3939672112464905,
            -0.26959970593452454,
            0.0020882156677544117,
            -0.019316434860229492,
            0.2466881275177002,
            -0.07453243434429169,
            -0.32417401671409607,
            0.10561931133270264,
            -0.008935625664889812,
            -0.10408923774957657,
            0.1579543501138687,
            0.41299188137054443,
            0.06107180193066597,
            -0.2391437441110611,
            -0.14189757406711578,
            -0.3693922758102417,
            0.10131105035543442,
            -0.20455756783485413,
            -0.32542771100997925,
            -0.05928785353899002,
            0.46950405836105347,
            0.13693073391914368,
            -0.41319939494132996,
            0.061922866851091385,
            0.07848729193210602,
            -0.1168779507279396,
            0.237325057387352,
            0.2996872365474701,
            -0.017329419031739235,
            -0.14590562880039215,
            0.11865273118019104,
            0.3495441973209381,
            -0.3701682388782501,
            0.2505962550640106,
            0.2209462672472,
            0.29491138458251953,
            -0.4133715331554413,
            0.09791848063468933,
            0.3955065608024597,
            -0.12631452083587646,
            0.05452984198927879,
            -0.1921013593673706,
            -0.18353193998336792,
            0.052227530628442764,
            -0.09861216694116592,
            -0.16366742551326752,
            -0.16078539192676544,
            -0.26491448283195496,
            -0.11709701269865036,
            0.06153132766485214,
            -0.048748090863227844,
            -0.050531141459941864,
            -0.22166559100151062,
            0.057900138199329376,
            0.17254681885242462,
            0.2689957916736603,
            0.04911826550960541,
            -0.07507836073637009,
            0.04669783264398575,
            -0.1210072934627533
          ],
          [
            0.04717889055609703,
            0.05754852667450905,
            0.08144504576921463,
            0.08150999248027802,
            0.12323111295700073,
            -0.08285427838563919,
            0.02341701276600361,
            0.13964560627937317,
            -0.331623375415802,
            0.015374606475234032,
            -0.11110850423574448,
            0.1432647407054901,
            0.025159848853945732,
            0.11275922507047653,
            0.03526850789785385,
            0.38088807463645935,
            -0.09809655696153641,
            0.07603151351213455,
            -0.1633608192205429,
            0.05408106744289398,
            0.01828312873840332,
            -0.1550084352493286,
            0.18333792686462402,
            0.04139954224228859,
            -0.07608386874198914,
            0.06371696293354034,
            -0.06925971806049347,
            -0.0921400859951973,
            0.04999406263232231,
            0.02541554532945156,
            0.12211279571056366,
            -0.005178729072213173,
            0.11517549306154251,
            -0.10282031446695328,
            -0.019928066059947014,
            -0.05783674865961075,
            0.08349835127592087,
            -0.01516198180615902,
            -0.6489030122756958,
            -0.31303101778030396,
            -0.12175735831260681,
            -0.12764503061771393,
            -0.12012901902198792,
            -0.07618484646081924,
            -0.06718240678310394,
            0.046313151717185974,
            0.16246800124645233,
            0.18768735229969025,
            0.019976383075118065,
            -0.5138159394264221,
            -0.15329204499721527,
            0.03393692523241043,
            0.07894600927829742,
            0.02257973700761795,
            -0.002316444180905819,
            -0.01020091399550438,
            0.002592591568827629,
            -0.4116191864013672,
            -0.02684728242456913,
            -0.006780094467103481,
            -0.11783509701490402,
            -0.02855159342288971,
            -0.05453667417168617,
            -0.8390418291091919
          ],
          [
            -0.008841448463499546,
            0.16025380790233612,
            -0.5644537210464478,
            -0.061485935002565384,
            0.22314096987247467,
            -0.30455005168914795,
            -0.02808099053800106,
            -0.1614474207162857,
            -0.2840036153793335,
            0.06233048439025879,
            -0.0645945593714714,
            0.048531673848629,
            0.12673334777355194,
            -0.05167780816555023,
            -0.14218972623348236,
            0.2521841824054718,
            0.25519928336143494,
            0.13115337491035461,
            0.03457918390631676,
            0.01910766027867794,
            -0.2605496942996979,
            -0.033269502222537994,
            -0.034357160329818726,
            -0.056254591792821884,
            -0.5690305233001709,
            0.1222263053059578,
            -0.8337981700897217,
            0.01096712052822113,
            -0.06165781244635582,
            0.032354936003685,
            -0.12109675258398056,
            0.22433814406394958,
            0.15513110160827637,
            -0.14035825431346893,
            -0.058883875608444214,
            0.12697724997997284,
            0.08773022890090942,
            -0.41095709800720215,
            0.26598870754241943,
            0.1629037708044052,
            -0.29632091522216797,
            0.034704145044088364,
            0.06014028191566467,
            -0.07057651877403259,
            0.023096224293112755,
            -0.17232368886470795,
            0.13396835327148438,
            -0.0002209433587267995,
            0.033879924565553665,
            -0.18729279935359955,
            -0.025902733206748962,
            -0.13666971027851105,
            -0.10321929305791855,
            -0.09258508682250977,
            -0.019857699051499367,
            -0.05022349953651428,
            0.020919203758239746,
            0.052990444004535675,
            -0.0180085189640522,
            0.051333703100681305,
            0.12411431968212128,
            -0.2004919946193695,
            0.08013813942670822,
            -0.1584903448820114
          ],
          [
            0.6997097134590149,
            0.06368455290794373,
            -0.09317146986722946,
            -0.24689358472824097,
            0.15959826111793518,
            0.1322629451751709,
            0.273509681224823,
            -0.3727928698062897,
            -0.05048453435301781,
            -0.190395325422287,
            -0.21217571198940277,
            0.17175914347171783,
            0.06074540317058563,
            -0.02452988363802433,
            0.02925318107008934,
            0.12187027931213379,
            -0.10714682191610336,
            0.0009678634814918041,
            -0.035969361662864685,
            0.3918171525001526,
            0.5848432183265686,
            -0.24486279487609863,
            -0.08086720108985901,
            -0.06609831005334854,
            0.05336495116353035,
            0.29791828989982605,
            -0.15628568828105927,
            -0.38464149832725525,
            0.2568739056587219,
            -0.016711141914129257,
            0.12711647152900696,
            -0.16175726056098938,
            0.10446726530790329,
            -0.017962535843253136,
            0.2704187035560608,
            0.17683883011341095,
            -0.11594021320343018,
            0.22768817842006683,
            -0.32345688343048096,
            0.15264636278152466,
            0.05003536865115166,
            0.3704455494880676,
            -0.26633527874946594,
            -0.08442872017621994,
            -0.09949669241905212,
            0.03251376003026962,
            -0.12364614009857178,
            0.3123876452445984,
            0.07277346402406693,
            -0.171905055642128,
            -0.04864342883229256,
            0.037629384547472,
            -0.2913397550582886,
            0.050769202411174774,
            0.24829186499118805,
            0.1849488466978073,
            0.6785392761230469,
            -0.2189323753118515,
            0.22852779924869537,
            0.019020745530724525,
            0.12576830387115479,
            -0.028009600937366486,
            0.37743574380874634,
            0.10429050028324127
          ],
          [
            0.18683214485645294,
            0.29555678367614746,
            -0.30095532536506653,
            0.021920928731560707,
            0.17479920387268066,
            -0.3830939829349518,
            -0.007016273215413094,
            0.08422493934631348,
            -0.1774955689907074,
            -0.054253555834293365,
            -0.10789036750793457,
            -0.4749757647514343,
            -0.31437739729881287,
            -0.06623765081167221,
            -0.11836689710617065,
            -0.14969567954540253,
            0.013936111703515053,
            0.19044631719589233,
            -0.075521320104599,
            -0.14527273178100586,
            0.05553590878844261,
            0.06550125032663345,
            0.31862321496009827,
            0.1374363899230957,
            0.38315898180007935,
            0.09175752848386765,
            -0.6071910262107849,
            -0.5550973415374756,
            0.2074240893125534,
            -0.15053872764110565,
            0.10882338881492615,
            -0.16246682405471802,
            0.05657387152314186,
            -0.18057090044021606,
            0.024009976536035538,
            0.3102404475212097,
            0.09255576878786087,
            -0.06945789605379105,
            0.08143025636672974,
            -0.6986246705055237,
            0.15141141414642334,
            -0.33745405077934265,
            -0.0764952301979065,
            -0.17359180748462677,
            -0.20533277094364166,
            0.02708320878446102,
            0.09365303069353104,
            0.06559024751186371,
            -0.18325597047805786,
            -0.3921756148338318,
            0.11724446713924408,
            0.03430153802037239,
            -0.11668920516967773,
            0.0033885438460856676,
            -0.03776444122195244,
            -0.20648744702339172,
            0.20683856308460236,
            -0.015929847955703735,
            0.06094083935022354,
            -0.016988670453429222,
            0.45636245608329773,
            -0.02744521200656891,
            -0.02455354481935501,
            -0.21245798468589783
          ],
          [
            0.0368211567401886,
            -0.1655329167842865,
            0.12289796769618988,
            -0.1843302994966507,
            -0.5837610363960266,
            0.31056761741638184,
            -0.4628531336784363,
            -0.04480230435729027,
            -0.3982381522655487,
            -0.1450626403093338,
            -0.9147375226020813,
            0.45684492588043213,
            -0.04459857940673828,
            -0.9518857002258301,
            -0.05015978589653969,
            -0.21046651899814606,
            -0.18638482689857483,
            -0.3041177988052368,
            -0.1935410052537918,
            -0.05970572680234909,
            0.10521309077739716,
            -0.14932940900325775,
            0.36081093549728394,
            -0.24567486345767975,
            0.45909151434898376,
            -0.19821827113628387,
            0.2764047086238861,
            0.21048088371753693,
            -0.3592366576194763,
            0.04364153370261192,
            -0.17206116020679474,
            0.12079865485429764,
            -0.29550275206565857,
            0.24172092974185944,
            -0.11957339197397232,
            0.05083968862891197,
            0.3880981504917145,
            -0.25076162815093994,
            -0.2658609449863434,
            0.2826061546802521,
            -1.2081503868103027,
            -0.047108687460422516,
            0.24446959793567657,
            0.07657988369464874,
            -0.3404313921928406,
            -0.19301345944404602,
            -0.18171735107898712,
            0.2764139473438263,
            0.05542532354593277,
            -0.1854849010705948,
            0.19244225323200226,
            0.139311745762825,
            -0.3225746750831604,
            0.23540347814559937,
            -0.004557695239782333,
            0.07366669923067093,
            0.15265658497810364,
            -0.2826043665409088,
            0.19195924699306488,
            -0.09840743243694305,
            -0.518510103225708,
            -1.0039165019989014,
            0.3427976965904236,
            -0.8412299156188965
          ],
          [
            -0.0660659521818161,
            0.14024265110492706,
            -0.3198659420013428,
            -0.1806846559047699,
            0.03165450319647789,
            0.015819337218999863,
            0.12402591854333878,
            -0.06250535696744919,
            0.11457701027393341,
            0.026598088443279266,
            0.030575715005397797,
            -0.42193207144737244,
            -0.08661103993654251,
            -0.2015179842710495,
            -0.046796590089797974,
            -0.5502336621284485,
            -0.031599823385477066,
            0.09013848006725311,
            -0.005109824240207672,
            -0.12170634418725967,
            0.013310383073985577,
            0.09064870327711105,
            0.17759031057357788,
            0.2203344702720642,
            0.29656782746315,
            0.03965818136930466,
            -0.11310789734125137,
            -0.23076631128787994,
            -0.03965117409825325,
            -0.8854078650474548,
            0.015305251814424992,
            0.08032537996768951,
            -0.009421780705451965,
            -0.21152490377426147,
            -0.012962711043655872,
            0.04255346208810806,
            -0.11090216785669327,
            -0.03676731511950493,
            0.017024341970682144,
            -0.03691628947854042,
            0.1929674744606018,
            0.026171572506427765,
            -0.10078706592321396,
            0.21594926714897156,
            -0.03141748160123825,
            0.03343268111348152,
            -0.04860933870077133,
            -0.028899991884827614,
            -0.14259907603263855,
            -0.21184585988521576,
            -0.05722281336784363,
            -0.07380489259958267,
            -0.30438119173049927,
            -0.06374315172433853,
            0.05759458616375923,
            -0.08373815566301346,
            0.18154409527778625,
            -0.2920982539653778,
            -0.2127494364976883,
            -0.0362975038588047,
            0.33255043625831604,
            0.0741187036037445,
            0.12897971272468567,
            -0.10015612840652466
          ],
          [
            0.16033637523651123,
            -0.21234130859375,
            -0.048752009868621826,
            -0.12361675500869751,
            0.016128063201904297,
            0.128395676612854,
            0.11017322540283203,
            -0.18140047788619995,
            0.15917789936065674,
            0.23104357719421387,
            0.0477219820022583,
            -0.14440667629241943,
            -0.07885569334030151,
            -0.10731679201126099,
            0.18631279468536377,
            -0.22655487060546875,
            0.238631010055542,
            -0.21172821521759033,
            0.22560739517211914,
            -0.04166179895401001,
            -0.006754577159881592,
            -0.06618106365203857,
            -0.17297309637069702,
            -0.1636589765548706,
            0.12911343574523926,
            0.06623488664627075,
            0.23309409618377686,
            0.2445310354232788,
            -0.19132965803146362,
            0.055389225482940674,
            0.24481898546218872,
            -0.18501806259155273,
            0.24219071865081787,
            -0.15968334674835205,
            -0.001967310905456543,
            0.10857999324798584,
            0.10960763692855835,
            -0.10799181461334229,
            0.18947851657867432,
            -0.03516566753387451,
            -0.04264038801193237,
            -0.1063125729560852,
            0.05492901802062988,
            -0.023534178733825684,
            0.056368112564086914,
            0.1400003433227539,
            0.21311116218566895,
            -0.18553805351257324,
            0.08808302879333496,
            -0.2369118332862854,
            0.04242348670959473,
            -0.1888725757598877,
            0.18137824535369873,
            -0.19034689664840698,
            -0.11478620767593384,
            0.16683310270309448,
            0.15750724077224731,
            -0.21117854118347168,
            -0.14736181497573853,
            0.07107031345367432,
            0.08930951356887817,
            0.19828027486801147,
            0.23631906509399414,
            0.10816115140914917
          ],
          [
            0.034303903579711914,
            -0.14993280172348022,
            -0.22161179780960083,
            0.11268562078475952,
            -0.17108458280563354,
            0.11490964889526367,
            -0.1910315752029419,
            -0.03326302766799927,
            0.15484535694122314,
            0.18427962064743042,
            0.014730393886566162,
            -0.12300848960876465,
            0.02275228500366211,
            -0.1145123839378357,
            0.2484869360923767,
            0.060668885707855225,
            0.11395204067230225,
            0.07356327772140503,
            -0.24526500701904297,
            0.11902832984924316,
            -0.04285401105880737,
            -0.1322857141494751,
            -0.06970751285552979,
            0.03218048810958862,
            0.22098684310913086,
            -0.12898290157318115,
            0.12367856502532959,
            -0.21959608793258667,
            0.09007042646408081,
            0.0019763708114624023,
            0.1204562783241272,
            -0.03236657381057739,
            -0.24722176790237427,
            0.1450905203819275,
            -0.05705714225769043,
            -0.08389759063720703,
            -0.23613852262496948,
            -0.09738624095916748,
            -0.13898658752441406,
            0.060141563415527344,
            0.06337416172027588,
            0.049736201763153076,
            0.1411009430885315,
            -0.224587082862854,
            -0.1534721851348877,
            0.07340860366821289,
            -0.2189897894859314,
            0.13084739446640015,
            -0.16086632013320923,
            -0.12381130456924438,
            -0.23424559831619263,
            0.16857439279556274,
            -0.03701204061508179,
            -0.06954729557037354,
            -0.046997785568237305,
            0.21095651388168335,
            0.013430595397949219,
            0.19670087099075317,
            -0.11256980895996094,
            -0.23616045713424683,
            0.020583271980285645,
            0.07293188571929932,
            -0.034709811210632324,
            -0.1284548044204712
          ],
          [
            0.15354430675506592,
            -0.06489521265029907,
            0.11695718765258789,
            0.06224709749221802,
            0.00837332010269165,
            -0.10079687833786011,
            0.19779831171035767,
            0.21502864360809326,
            0.005677640438079834,
            0.16223442554473877,
            0.1366700530052185,
            -0.026295840740203857,
            -0.05526930093765259,
            -0.1600179672241211,
            -0.13216346502304077,
            -0.1391059160232544,
            -0.10968250036239624,
            -0.16565150022506714,
            -0.23472297191619873,
            -0.11621981859207153,
            -0.07950544357299805,
            -0.08265012502670288,
            -0.20248693227767944,
            0.11952412128448486,
            -0.008616209030151367,
            -0.19288122653961182,
            -0.02710801362991333,
            0.0472264289855957,
            -0.18042290210723877,
            0.18408572673797607,
            -0.18557238578796387,
            0.22899949550628662,
            0.05444210767745972,
            -0.18693745136260986,
            0.2186274528503418,
            0.15699052810668945,
            -0.13487833738327026,
            -0.07818543910980225,
            0.004760563373565674,
            0.19599807262420654,
            0.001683354377746582,
            0.0019609928131103516,
            -0.1759321689605713,
            0.060957908630371094,
            0.082916259765625,
            0.019755244255065918,
            -0.026510179042816162,
            0.04749894142150879,
            -0.16755831241607666,
            0.22571051120758057,
            -0.19957250356674194,
            -0.1110270619392395,
            -0.04939967393875122,
            -0.16498267650604248,
            -0.21533244848251343,
            -0.026271939277648926,
            0.17698639631271362,
            0.11655086278915405,
            -0.1516321301460266,
            -0.18575292825698853,
            -0.005697906017303467,
            -0.06735062599182129,
            -0.21208679676055908,
            0.11701148748397827
          ],
          [
            -0.14692021906375885,
            0.1894894391298294,
            0.3140978515148163,
            -0.04261266067624092,
            -0.14103177189826965,
            -0.12652328610420227,
            -0.757575511932373,
            0.5129368901252747,
            -0.14941738545894623,
            0.4736845791339874,
            -0.023589832708239555,
            -0.20177772641181946,
            -0.33524611592292786,
            0.10889443010091782,
            -0.553591787815094,
            -0.3963831663131714,
            -0.8608373403549194,
            0.4075287878513336,
            -0.19236686825752258,
            0.02486596070230007,
            0.1489591896533966,
            0.5036662817001343,
            -0.08636945486068726,
            0.32493188977241516,
            0.4821997582912445,
            -0.3348080813884735,
            -0.41944679617881775,
            0.18568064272403717,
            -0.11817196756601334,
            0.4309639632701874,
            -0.1091318279504776,
            0.02913656458258629,
            0.5509274005889893,
            0.16538582742214203,
            0.04356371983885765,
            0.2382025569677353,
            -0.08431459963321686,
            -0.44382861256599426,
            0.4638587236404419,
            -0.34145912528038025,
            0.4518112540245056,
            -0.0868113785982132,
            -0.12608924508094788,
            0.0997624546289444,
            -0.23818273842334747,
            -0.051768261939287186,
            -0.21538154780864716,
            0.2426619678735733,
            0.5468593239784241,
            -0.2312983125448227,
            -1.0641896724700928,
            0.43447810411453247,
            -0.8128600120544434,
            0.18090064823627472,
            0.07774725556373596,
            0.1103636622428894,
            0.1527237594127655,
            -0.773609459400177,
            -0.016675857827067375,
            -0.08744852989912033,
            -0.25706300139427185,
            -0.4402405321598053,
            -0.010656042955815792,
            -0.26061660051345825
          ],
          [
            0.021635565906763077,
            -0.030494490638375282,
            -0.005818377714604139,
            0.013104851357638836,
            -0.16185595095157623,
            0.11689622700214386,
            0.24926993250846863,
            -0.15116624534130096,
            0.3063115179538727,
            -0.33005309104919434,
            0.3565904498100281,
            0.046797823160886765,
            -0.3021797239780426,
            -0.06669549643993378,
            -0.060072436928749084,
            0.011100844480097294,
            -0.08997950702905655,
            -0.05414929613471031,
            0.11499439924955368,
            0.28327763080596924,
            0.003719928441569209,
            -0.26067811250686646,
            -0.010161186568439007,
            -0.07503968477249146,
            -0.3247183859348297,
            -0.2721632719039917,
            -0.08515247702598572,
            -0.32763710618019104,
            0.006075114943087101,
            0.0053971610032022,
            -0.0073198419995605946,
            -0.0164770670235157,
            -0.14390094578266144,
            -0.017770297825336456,
            -0.31577494740486145,
            -0.30782678723335266,
            0.038060031831264496,
            0.12495779991149902,
            -0.2708238363265991,
            0.007154312916100025,
            -0.3157792091369629,
            -0.01019881758838892,
            -0.09107846766710281,
            0.17011356353759766,
            0.1606711894273758,
            -0.16595196723937988,
            -0.17421942949295044,
            0.021683236584067345,
            -0.1044720858335495,
            -0.36151084303855896,
            0.1485356241464615,
            0.059415653347969055,
            -0.042983073741197586,
            -0.1365291029214859,
            -0.4433421790599823,
            0.48070740699768066,
            0.22770936787128448,
            0.12867388129234314,
            0.011037243530154228,
            0.029538946226239204,
            -0.1947423368692398,
            0.06191731616854668,
            0.013728811405599117,
            -0.10682263225317001
          ],
          [
            0.13260284066200256,
            0.004913441836833954,
            -0.07132042944431305,
            -0.2000378668308258,
            -0.13088220357894897,
            -0.47397860884666443,
            0.02203494682908058,
            0.1626349538564682,
            -0.3110905885696411,
            -0.49361974000930786,
            0.07293205708265305,
            -0.21688921749591827,
            0.022054510191082954,
            0.14261840283870697,
            0.37889549136161804,
            0.0019173757173120975,
            -0.9825078248977661,
            0.16214284300804138,
            -0.17793847620487213,
            0.0673767551779747,
            -0.18554580211639404,
            -0.023725328966975212,
            -0.32187023758888245,
            0.13072848320007324,
            -0.15133769810199738,
            -0.33952218294143677,
            -0.1380748301744461,
            0.14173197746276855,
            0.11855315417051315,
            -0.1277952343225479,
            0.46472904086112976,
            0.28311431407928467,
            0.0959642082452774,
            -0.5928367376327515,
            -0.06253796815872192,
            0.21208032965660095,
            -0.08852861821651459,
            0.12260180711746216,
            -0.2956816852092743,
            -0.5428619980812073,
            -0.6348323225975037,
            0.33816957473754883,
            0.1629805862903595,
            -0.1505293846130371,
            -0.2535611391067505,
            0.11834124475717545,
            0.08155172318220139,
            0.4441491365432739,
            -0.3396739363670349,
            -0.23298372328281403,
            0.17975223064422607,
            0.08475901186466217,
            0.06668809056282043,
            0.21540869772434235,
            -0.35662198066711426,
            -0.027168922126293182,
            -0.09616198390722275,
            0.2794044315814972,
            -0.617889404296875,
            -0.14508071541786194,
            -0.37901854515075684,
            -0.6481794118881226,
            0.12929405272006989,
            -0.42515242099761963
          ],
          [
            -0.30495840311050415,
            -0.1289542019367218,
            0.12136343866586685,
            -0.03329690545797348,
            -0.1636093705892563,
            0.078770712018013,
            0.13826198875904083,
            0.009046314284205437,
            -0.13548552989959717,
            -0.024160180240869522,
            0.25760403275489807,
            -0.04211368039250374,
            -0.01200036983937025,
            -0.37929385900497437,
            0.21768364310264587,
            0.2941904664039612,
            -0.04974358156323433,
            0.09766118228435516,
            -0.21889491379261017,
            0.014034795574843884,
            0.07920080423355103,
            0.2875925302505493,
            0.06511669605970383,
            0.18521106243133545,
            -0.08002375811338425,
            0.06985057890415192,
            0.15845325589179993,
            -0.006335660349577665,
            -0.21020987629890442,
            0.37024906277656555,
            -0.18610790371894836,
            -0.19468262791633606,
            0.03446174040436745,
            -0.20825666189193726,
            -0.07415550202131271,
            0.14959828555583954,
            0.0897378996014595,
            0.08025921136140823,
            0.35371869802474976,
            0.1763370782136917,
            0.07465428858995438,
            0.2611779272556305,
            0.1314498484134674,
            0.10458478331565857,
            -0.15959550440311432,
            -0.008164681494235992,
            0.24706660211086273,
            -0.020891422405838966,
            0.06993568688631058,
            0.3043413460254669,
            0.22685448825359344,
            -0.07549736648797989,
            -0.022854821756482124,
            -0.12565696239471436,
            0.06441966444253922,
            0.03597025200724602,
            0.07853799313306808,
            0.023537568747997284,
            -0.12744125723838806,
            -0.15035885572433472,
            -0.2796036899089813,
            0.03599224239587784,
            0.11331003904342651,
            0.06328242272138596
          ],
          [
            -0.4080502986907959,
            0.45163723826408386,
            -0.2458246946334839,
            0.2332575023174286,
            -0.024022869765758514,
            -0.3743663728237152,
            -0.11819159984588623,
            -0.0650462880730629,
            -0.027134250849485397,
            -0.024681083858013153,
            -0.09704253077507019,
            -0.09485061466693878,
            -0.10972897708415985,
            0.41696253418922424,
            -0.03655622899532318,
            0.2519649863243103,
            0.14042417705059052,
            -0.16275598108768463,
            0.28862300515174866,
            0.021277334541082382,
            -0.13621999323368073,
            -0.21956484019756317,
            -0.4663656949996948,
            -0.015089652501046658,
            -0.3595609962940216,
            -0.23985867202281952,
            -0.016282595694065094,
            -0.009689241647720337,
            0.12972548604011536,
            -0.6221394538879395,
            0.08423014730215073,
            -0.019670750945806503,
            0.33914464712142944,
            -0.006546704098582268,
            0.23809412121772766,
            -0.08104296773672104,
            0.08242747187614441,
            0.07580480724573135,
            -0.0515296496450901,
            -0.122045136988163,
            -0.2072611153125763,
            -0.09354716539382935,
            -0.7671964168548584,
            -0.2724609076976776,
            -0.06453511118888855,
            -0.20137368142604828,
            -0.18779954314231873,
            -0.06245554983615875,
            0.23551024496555328,
            -0.1870812028646469,
            -0.0016304018208757043,
            0.10789396613836288,
            -0.06503164768218994,
            0.2190999984741211,
            -0.28026652336120605,
            0.03269423171877861,
            0.1729729175567627,
            -0.419717937707901,
            -0.11542268097400665,
            0.027464281767606735,
            0.03491600230336189,
            -0.24049818515777588,
            0.225978285074234,
            -0.33886459469795227
          ],
          [
            -0.07426398992538452,
            -0.0459684357047081,
            -0.08249783515930176,
            0.3197968602180481,
            0.26330336928367615,
            -0.14010003209114075,
            0.3806226849555969,
            0.5117765069007874,
            0.22088691592216492,
            0.13006898760795593,
            0.4042886197566986,
            0.1104574203491211,
            -0.3405191898345947,
            -0.472859650850296,
            0.689820408821106,
            -0.12305217981338501,
            0.5322737693786621,
            -0.03185974434018135,
            0.3384288549423218,
            -0.2454700618982315,
            -0.002119403565302491,
            0.5329256057739258,
            0.22835737466812134,
            0.01737228035926819,
            0.1370314061641693,
            -0.43305307626724243,
            0.0033810308668762445,
            0.035047613084316254,
            -0.5510020852088928,
            0.4219000041484833,
            0.3884277045726776,
            0.4111856520175934,
            0.27375373244285583,
            -0.1769024133682251,
            0.40491876006126404,
            -0.14950816333293915,
            0.3876950442790985,
            0.2552936375141144,
            0.4809417724609375,
            0.35548391938209534,
            -0.01423464622348547,
            -0.21770964562892914,
            0.3815616965293884,
            -0.014433193951845169,
            0.22398357093334198,
            -0.004946998320519924,
            -0.1761520653963089,
            0.32574620842933655,
            -0.5764719843864441,
            0.14947625994682312,
            0.4463033378124237,
            0.2508162558078766,
            -0.10448143631219864,
            -0.007765636313706636,
            0.019748210906982422,
            -0.6887603402137756,
            0.037679098546504974,
            0.21082228422164917,
            0.0614696629345417,
            0.24229805171489716,
            0.007480638101696968,
            -0.1359248012304306,
            -0.23002363741397858,
            -0.23478445410728455
          ],
          [
            0.19055180251598358,
            -0.07573951780796051,
            -0.6289357542991638,
            -0.25492697954177856,
            0.17286646366119385,
            0.08994972705841064,
            -0.41960960626602173,
            0.4898640513420105,
            0.27811503410339355,
            0.16366416215896606,
            0.14907607436180115,
            -0.4083509147167206,
            0.7128172516822815,
            0.10182835906744003,
            -0.7817647457122803,
            0.028207629919052124,
            0.11924775689840317,
            0.11757458001375198,
            -0.34141480922698975,
            -0.311333566904068,
            -0.39079105854034424,
            0.43562933802604675,
            -0.30586180090904236,
            0.5713865160942078,
            0.1870945245027542,
            0.650027334690094,
            0.10575882345438004,
            0.47000792622566223,
            -0.4632262587547302,
            0.2011966109275818,
            0.10348152369260788,
            -0.4423155188560486,
            0.19875261187553406,
            0.35156333446502686,
            -0.15798351168632507,
            -0.4523155689239502,
            -1.2035330533981323,
            0.08174331486225128,
            0.2764637768268585,
            0.2434554398059845,
            0.6084274649620056,
            -0.3422037959098816,
            0.42413443326950073,
            0.16076156497001648,
            0.09973854571580887,
            0.6837027072906494,
            -0.39637595415115356,
            0.427938848733902,
            0.3309420049190521,
            0.27486807107925415,
            -0.3295217752456665,
            0.332913339138031,
            -0.1340504288673401,
            0.5364086031913757,
            0.17101246118545532,
            -0.08422849327325821,
            0.40052229166030884,
            0.17402470111846924,
            0.3153872787952423,
            0.38178449869155884,
            -0.029339369386434555,
            0.40230342745780945,
            0.005962857510894537,
            0.20313487946987152
          ],
          [
            0.1596866399049759,
            0.36204424500465393,
            0.3062531650066376,
            0.23004522919654846,
            0.38127848505973816,
            -0.042499031871557236,
            0.021308716386556625,
            -0.21101348102092743,
            -1.0896191596984863,
            0.15866221487522125,
            -0.2756767272949219,
            -0.4366513192653656,
            -0.5676264762878418,
            -0.12084878236055374,
            0.21354623138904572,
            -0.3309006989002228,
            0.48212653398513794,
            -0.5011051893234253,
            0.37633851170539856,
            -0.0011286629596725106,
            -0.49090662598609924,
            -0.22871021926403046,
            -0.2806406021118164,
            -0.4029029905796051,
            -0.9036571979522705,
            0.2907131612300873,
            -0.17823591828346252,
            -0.14195236563682556,
            -0.12452872097492218,
            0.3710506856441498,
            -0.38955530524253845,
            0.3254028260707855,
            0.13809259235858917,
            0.1512734740972519,
            0.09063342213630676,
            0.03837571293115616,
            -0.17054635286331177,
            0.22003287076950073,
            -0.14697705209255219,
            0.02691621333360672,
            0.20435573160648346,
            -0.31681108474731445,
            -0.26565563678741455,
            -0.10067612677812576,
            -0.41633662581443787,
            0.3771716058254242,
            -0.2511053681373596,
            0.10321182757616043,
            -0.07717835903167725,
            -0.1282661110162735,
            0.3632606863975525,
            -0.2604173719882965,
            -0.1540900617837906,
            -0.032326363027095795,
            0.18357589840888977,
            0.18393690884113312,
            -0.1311713457107544,
            -0.10579261928796768,
            -0.3385262191295624,
            -0.06161361187696457,
            0.09997496753931046,
            -0.015579413622617722,
            0.0034019723534584045,
            0.4229620397090912
          ],
          [
            -0.2900569438934326,
            0.09246323257684708,
            -0.3772474229335785,
            -0.01448647677898407,
            -0.7235859036445618,
            0.20070558786392212,
            0.05674086883664131,
            0.12158770114183426,
            -0.07188074290752411,
            0.11195243895053864,
            -0.8330972790718079,
            0.01711500622332096,
            -0.277730256319046,
            -0.23795072734355927,
            -0.03893709555268288,
            -0.1833437830209732,
            -0.27756360173225403,
            -0.11306007206439972,
            -0.2848401963710785,
            0.039644818753004074,
            -0.45154500007629395,
            0.2765148878097534,
            0.09622731804847717,
            0.202224999666214,
            0.24090301990509033,
            -1.7651655673980713,
            -0.5519241094589233,
            -0.1705169975757599,
            0.1467089205980301,
            -0.27381229400634766,
            -0.398893266916275,
            0.0793658196926117,
            0.05314532667398453,
            -0.1282682865858078,
            -0.15958546102046967,
            -0.129810631275177,
            -0.2787117063999176,
            0.10691367089748383,
            0.09577997773885727,
            -0.26137787103652954,
            -1.280556082725525,
            0.04686548933386803,
            0.03197767212986946,
            -0.13836757838726044,
            0.1344573050737381,
            -0.06301414966583252,
            -0.270842045545578,
            0.19342786073684692,
            -0.05075190216302872,
            -0.6335878968238831,
            -0.05995669588446617,
            0.36374619603157043,
            0.08391627669334412,
            -0.07922488451004028,
            0.3326406180858612,
            -0.08713922649621964,
            -0.5098302960395813,
            -0.0664191022515297,
            -0.3205389976501465,
            0.06042460724711418,
            0.11914770305156708,
            0.2831164598464966,
            0.16689622402191162,
            -0.46456626057624817
          ],
          [
            -0.18952667713165283,
            0.007886831648647785,
            -0.3604262173175812,
            -0.7683119773864746,
            -0.0873543992638588,
            -0.10495518147945404,
            -0.01698341593146324,
            0.049648527055978775,
            -0.3297570049762726,
            0.5384821891784668,
            -0.620985209941864,
            0.30783289670944214,
            0.3007480204105377,
            0.34656259417533875,
            0.12876589596271515,
            0.21746551990509033,
            -0.2853289544582367,
            -0.030163142830133438,
            -0.017173394560813904,
            0.664117157459259,
            -0.24245747923851013,
            -0.12895433604717255,
            -0.6689573526382446,
            -0.2961912453174591,
            -0.2475292682647705,
            -0.008428245782852173,
            0.09833481907844543,
            0.05893191695213318,
            -0.18697787821292877,
            -0.7710244655609131,
            -0.48529040813446045,
            -0.7691987156867981,
            -0.13428053259849548,
            0.39035549759864807,
            -0.28949838876724243,
            -0.4546705484390259,
            -0.3469809293746948,
            0.0704595223069191,
            0.3166320025920868,
            0.17008517682552338,
            0.16301588714122772,
            -0.16391047835350037,
            -0.01824249140918255,
            -0.5073421001434326,
            -0.3084292709827423,
            0.02346397191286087,
            -0.09167198091745377,
            0.2422170639038086,
            0.11035697162151337,
            0.07128443568944931,
            0.3305003345012665,
            -0.2816992402076721,
            -0.21561020612716675,
            0.48705682158470154,
            -0.2055124193429947,
            -0.4482477307319641,
            -0.8633052110671997,
            0.048314958810806274,
            -0.5835263729095459,
            0.4519944489002228,
            0.5808277726173401,
            -0.35690397024154663,
            0.04214320331811905,
            -0.5458883047103882
          ],
          [
            0.02428864687681198,
            0.04369308054447174,
            0.008268195204436779,
            0.12843534350395203,
            -0.45502975583076477,
            0.0878891572356224,
            0.022772129625082016,
            -0.0033099614083766937,
            0.04384274780750275,
            0.11578615009784698,
            0.061270520091056824,
            -0.28013351559638977,
            0.05353822186589241,
            -0.6138201355934143,
            -0.12769661843776703,
            0.2713949680328369,
            -0.10929830372333527,
            -0.5749810338020325,
            -0.01189780980348587,
            -0.5290066003799438,
            0.0651460513472557,
            0.5823573470115662,
            -0.1661212295293808,
            0.1879160851240158,
            -0.33096352219581604,
            0.24129322171211243,
            -0.0626901164650917,
            0.21558089554309845,
            0.12145503610372543,
            -0.06286122649908066,
            0.18918465077877045,
            -0.06306752562522888,
            0.033304985612630844,
            -0.11467352509498596,
            -0.08393856883049011,
            0.004485264420509338,
            -0.06251906603574753,
            0.1541423350572586,
            0.09923122078180313,
            0.2106056809425354,
            0.0318213514983654,
            -0.2565687894821167,
            -0.14324228465557098,
            -0.16129671037197113,
            -0.21898546814918518,
            0.3384702205657959,
            -0.11234316974878311,
            0.3849698305130005,
            0.1795804649591446,
            -0.5371097326278687,
            0.15262123942375183,
            0.21550029516220093,
            0.4820352792739868,
            0.12937235832214355,
            0.20922742784023285,
            -0.033939097076654434,
            -0.25859513878822327,
            0.3540976643562317,
            0.06414427608251572,
            -0.2601454555988312,
            -0.0961993858218193,
            0.045187849551439285,
            0.25022879242897034,
            -0.21182413399219513
          ],
          [
            -0.48721569776535034,
            0.00012197197793284431,
            -0.07937988638877869,
            -0.3500215709209442,
            -0.04829402640461922,
            -0.48496487736701965,
            0.2554108500480652,
            -0.25243303179740906,
            -0.918024480342865,
            0.3999547064304352,
            -0.4824450612068176,
            0.1834438294172287,
            0.03814820572733879,
            -0.3544493317604065,
            -0.024807723239064217,
            -0.29349565505981445,
            0.1457524597644806,
            0.21967552602291107,
            -0.049695368856191635,
            0.04538634791970253,
            -0.36276060342788696,
            -0.052278101444244385,
            -0.06526945531368256,
            0.3150354325771332,
            -0.7736040353775024,
            -0.15876372158527374,
            -0.3493137061595917,
            0.1966884285211563,
            -0.2286076843738556,
            -0.13970991969108582,
            0.1647452414035797,
            -0.3973034620285034,
            0.06246516853570938,
            -0.12285106629133224,
            -0.44878190755844116,
            -0.015606829896569252,
            -0.24211916327476501,
            -0.05440005660057068,
            -0.09956121444702148,
            0.12674358487129211,
            -0.07396024465560913,
            -0.05006183311343193,
            -0.17087037861347198,
